{
"text": " Welcome everybody and thank you for taking the time to join our third quarter 2022 earnings conference call. Joining me on the call today is our Chief Executive Officer, Rory Bern, our Chief Operating Officer, Yoann Lyndon and our Chief Financial Officer, Chessinta Divine. During this call, we will be referring to presentation slides without mental remarks. And these, along with our earnings release, financial statements and other related materials are available on the Investor Relations section of the LOPOC website. Please note our remarks today will include certain forward-looking statements within the provisions of the Federal Security of Safe Harbor Law. These reflect circumstances at the time they are made and the company expressly disclaims any obligation to update or revise any forward-looking statements. Actual results or outcomes may differ materially from those that may be expressed or implied due to a wide range of factors, including those set forward in our FEC filing suppressor releases. Information regarding views of non-GAAP financial measures may be found in our press release, which also includes the reconciliation to the most comparable GAAP measures. Our financial statements for the third quarter were also filed at the SEC area today and contained reported financial information for the quarter's end of September 2022 and 30 September 2021. And the 9 months end of September 2022 and 2021. Arranging the press release and Investor presentation also reference pro forma compared to financial information. This pro forma information illustrates still PLC's results for the third quarter and first 9 months of 2021 as if the merger IPO and refinancing had occurred on January 1, 2020. This is consistent with the pro forma financial information presented in FormF1 files with the SEC and connection with the IPO. With that, I'm pleased to turn today's call over to Rory. Thank you James. Welcome everybody and thank you for joining us today. Well, we're very pleased that the group has delivered strong results for the third quarter. On a pro forma, comparative basis, excluding the impact of currency translation and net M&A activity, revenue increased by approximately 5% was compared to the third quarter of 2021. Adjustity of $73 million was ahead of expectations and significantly ahead of the prior year. The significant increase in adjustity of the bidda was driven by a strong performance in our fresh food segment offset and parked by the ongoing recovery in our vegetable's business and a specific challenge in our diversified America segment in the quarter. Adjusted net income and EPS also increased significantly compared to the prior year driven by the increase in adjustity bidda. In the third quarter, we continue to have a strong focus operationally on cash flow. I'm very pleased to announce today a cash dividend for the third quarter of $8 per share. This continues our commitment to return cash to shareholders. So, turning to slide 8 for our operational highlights. In our fresh food segment, we delivered a strong result of quarter. North America and commercial carval operations continue to belong very well with healthy demand, positive market pricing and good shipping rates. In Europe, high shipping rates and adverse currency movements continue to impact on performance. However, we are making good progress in managing these challenges. Supply and demand dynamics in the banana market overall have been unprecedented in 2022 and this remains a key factor as we work towards the end of this year and continue with negotiations for 2023. Overall, with our diverse source and base, our leading customer profile, we believe a well-placed have a strong finish to 2022 and a positive outlook for 2023 in this division. Our diversified EMEA segment continues to trade well on a like for like basis in Q3, despite increasing inflation repressures in our core markets, again demonstrating the ability to price dynamically at benefit from product and geographic diversity. Our diversified EMEA segment was impacted by a specific issue at the end of the Chilly and Grape season in North America. Significant supply chain disruptions led to exceptional advantageous proposals that impacted profitability. The overall scale and range of activity in our diverse side segments reduces the impact of the Chilly Grape issue when we look at our results on a full-year basis, demonstrating again the benefit of a wide range of products and job fees. Our third quarter performance and fresh vegetables remain disappointing and while we're making progress on our turnaround plan, it is slower than we would like. category of demand will softer in Q3 and ongoing inflation continues in important cost areas. In addition, we face higher sourcing costs due to weather-related events and key Californian growing regions, which impact the entire industry. More positively, however, our detailed turnaround plan is beginning to year benefits. From a volume perspective, we recently achieved a number of important customer wins as we looked to build back up our volume base for 2023. In all major areas of operation, we have developed detailed profit improvement plans and we are monitoring these closely. We continue to explore all strategic alternatives for this segment and expect to see your recovery in 2023. With that, I'm hon. Joe to just send to give the peninsure review. Thank you, Rory. Good morning and good afternoon. Please turn to slide 10. As Rory mentioned, we delivered a strong performance for the third quarter compared to the prior year. Revenue for the third quarter decreased marginally against the pro-former comparison, driven by negative effects movements and the impact of M&A in our diversified immediate segment and lower volumes in our vegetable segment. On a light-for-like basis, revenue increased 5% driven by inflation justified price increases. Adjusted EBITDA for the third quarter increased 26% to $7.3 million, with the increase driven by a strong performance in the fresh fruit segment. Similar to Q2, foreign currency translation impacted results by $4 million and stripping this out, adjusted EBITDA increased 32% on a light-for-like basis, turning to slide 11. The significant net income was 13.5 million for the third quarter, significantly ahead of the prior year. The increase was driven by higher adjusted EBITDA, which offset an increase in interest expense. Adjusted fully-deleted EPS for the quarter was 14% compared to 7% in the prior year, and 3% on a pro-former comparison basis, again driven by the increase in adjusted EBITDA. I will now fight some more detail on each of the individual segments starting with fresh fruits on slide 13. We continue to see good momentum in this segment with revenue for the third quarter, increasing 11.7% compared to the pro-former comparison. The increase was driven by higher worldwide pricing and commercial cargo and higher volumes of bananas in North America. This was partially offset by lower volumes for bananas in Europe and North America. Adjusted EBITDA increased 200% from 17 million to 51 million for the quarter, driven by higher revenue. Moving to diversified price-produced amea on slide 14, as with prior quarters, revenue and this segment continues to be impacted by foreign currency translation. On a like for like basis, revenue increased 4%, driven by strong performance across the division and overall higher pricing. Similarly, adjusted EBITDA decreased on a reported basis due to foreign currency translation, however, on a like for like basis, adjusted EBITDA increased slightly by 0.1%. Then turning to diversified fresh produce, America's and rest world, revenue for the third quarter increased 5.8% continuing the good momentum seen in the first half of the year. The increase was driven by higher overall average selling prices, particularly in North American markets for avocados, potatoes and onions. Our results in this segment were impacted by a difficult end to the Chilean grape season in North America, leading to a loss in the quarter. Then finally turning to fresh vegetables. Lower volumes contributed to a 5% reduction in revenue for the quarter. The segment continues to recover from the impact of the value out of salary call and plant suspensions at the outset of the year, as well as lower tax rate demand. Lower revenue, along with persistent inflation in impokop and specific industry-wide weather challenges in California growing region, led to an adjusted EBITDA loss of 9 million for the quarter. Now turning to slide 17, capital expenditures for the third quarter were 27 million, and we now have invested 67 million year to date, spread over reinvestments in farm and last-houses in our growing regions, the acquisition of an addition of farm and Peru and efficiencies in logistics, warehousing and processing closer to the markets. We are now expecting capital expenditure of 95 million for the year, a reduction of 50 million from our previous guidance. The reduction follows a reassessment of capital projects within the group. Working capital remains elevators, mainly due to the proportionary measures taken earlier in the year to build up inventories and also due to the inflationary impact of impokop. We expect to see this unwind due to the normal seasonal working capital effects at this time of year. However, we do still see higher underlying level of working capital this year compared to prior years. Our net leverage at the end of the quarter was 3.4 times. We expect leverage to decrease further in the final quarter of 2022 as seasonal working capital episodes online. Turning to slide 18. We also continue to focus on our disappointing share price and believe that our valuable strategic asset base is not fully recognized. To highlight this, we have included slide in our investor presentation setting out a sum of the parts valuation approach using a two division structure. The asset division more than covers the total debt, while the operating division currently generates a 200 30 to 250 million on a debt free basis after charging a proxy lease payment to serve the debt. This is one example of the real value end all that we believe is not being reflected in our current share price. Now I will hand you back to Rory who will give an update on our full year outlook and closing remarks. Thank you, Jacinta. The economic environment does remain dynamic as we have progressed towards the end of 2022 and we continue to see positive trends and some ongoing challenges. It is clear that the global economy is difficult with inflation and interest rates continue to rise. We remain highly focused on operating efficiencies, capital discipline and seeking price increases to compensate for cost increases. We believe we are well positioned with a broad portfolio of healthy and nutritious products in an industry that does continue to be underpinned by strong fundamentals. However, when I expect a full year of just a little bit dark, we have the lower end of the previously guided range due to the ongoing challenges in our fresh vegetable segment, which have slowed its recovery as well as the specific Q3 issue at the end of the Chilling and Great Seas North America. In conclusion, we remain positive on our medium to long-term outlook under intensity focus and our short-term priorities for the remainder of 2022 and into 2023. Our principal priorities are, clearly, the turnaround of our value out of solid business, focusing on cost control and operating efficiencies across all our businesses, including the ongoing synergy projects continuing with the disciplined approach to capital. Before I conclude, I would like to highlight that the first nine months of the year, three out of our four segments have performed well, especially considering the complex operating environment, and we're very focused on the turnaround of our fresh vegetables business. Want to finish by thanking again a committed team for their ongoing efforts to drive our business forward, and also by thanking our critical partners and customers for their ongoing support, which allows us to look at the future with great confidence. So with that, our hands are back to the operator and we can open the line for questions. Thank you. Thank you. If you would like to ask a question, please press star for level one on your telephone keypad now. If you change your mind, please press star for level two. When preparing to ask your question, please ensure your device is unmuted locally. Our first question today comes from Adam Sanyelson from Goldman Sachs. Your line is open. Oh, yes. Thank you. Good morning, everyone. Morning, Adam. Morning, Adam. in California growing region led to an adjusted epitaph of 9 million for the quarter. Now turning to slide 17, capital expenditures for the third quarter were 27 million. And we now have invested 67 million year-to-date spread over reinvestments in farm and last-houses in our growing regions. The acquisition of an addition of farm and Peru and efficiencies in logistics, warehousing, and processing closer to the market. We are now expecting capital expenditure of 95 million for the year, a reduction of 50 million from our previous guidance. The reduction follows a reassessment of capital projects within the group. Working capital remains elevators, mainly due to the proportionary measures taken earlier in the year to build up invatries, and also due to the inflationary impact of impokosts. We expect to see this unwind due to the normal seasonal working capital effects at this time of year. However, we do still see a higher underlying level of working capital this year compared to prior years. Our net leverage at the end of the quarter was 3.4 times. We expect leverage to decrease further in the final quarter of 2022 as seasonal working capital episodes online. Turning to slide 18. We also continue to focus on our disappointing share price and believe that our valuable strategic at-base is not being fully recognized. To highlight this, we have included slide in our investor presentation setting out a sum of the part valuation approach using a two division structure. The asset division more than covers the total debt while the operating division currently generates a just 3.5 out of 230 to 250 million on a debt-free basis after charging a proxy lease payment to serve the debt. This is one example of the real value and all that we believe is not being reflected in our current share price. Now, I will hand you back to Rory who will give an update on our full-year outlook and closing remarks. Thank you, Jacinta. Well, the economic environment does remain dynamic as we've progressed towards the end of 2022, and we continue to see positive trends and some ongoing challenges. It's clear that the global economy is difficult with inflation and interest rates continue to rise. We remain highly focused on operating efficiencies, capital discipline, and seeking price increases to compensate for cost increases. We believe we're well positioned with a broad portfolio of healthy and nutritious products in an industry that does continue to be underpinned by strong fundamentals. However, when I expect our full-year adjustity but dark, we have the lower end of the previously guided range due to the ongoing challenges in our fresh vegetable segment, which have slowed its recovery, as well as the specific Q3 issue at the end of the Chidding and Great Seas in North America. In conclusion, we remain positive on our medium to long-term outlook and are intensity focused on our short-term priorities for the remainder of 2022 and into 2023. Our principle of priorities are, clearly, the turnaround of our value out of solid business, focusing on cost control and operating efficiencies across all our businesses, including the ongoing synergy projects continuing with the disciplined approach to capital. Before I conclude, I would like to highlight that the first nine months of the year, three out of our four segments have performed well, especially considering the complex operating environment, and we're very focused on the turnaround of our fresh vegetable business. Want to finish by thanking again our committed team for their ongoing efforts to drive our business forward, and also by thanking our critical partners and customers for their ongoing support, which allows to look at the future with great content. So with that, our minds are back to the outbreak and we can open the line for questions. Thank you. Thank you. If you would like to ask a question, please press star for level one on your telephone keypad now. If you change your mind, please press star for level two. When preparing to ask your question, please ensure your device is unmuted locally. Our first question today comes from Adam Sanyelson from Goldman Sachs. Your line is open. Oh, yes. Thank you. Good morning, everyone. Morning, Adam. Morning. So first question is we think about the performance in the quarter and the outlook. In fresh vegetables, can we maybe talk about from where we are in ending the third quarter with the even thought loss and help us think about the trajectory and pathway and what has to happen for that to be a positive introduction to the, on this not in the fourth quarter, and certainly in calendar 23. Yeah, maybe I can take that one more. So we are very happy with the work that the division is doing right now. We are focusing on servicing the customers and because we know good service in the end leads to a new customer contract and much easier pricing and discussions. And we are focusing and doing good progress on our turnaround plan. And we executing on that plan. And there is a lot of different facets to that plan. It's about reviewing all the costs that we're having. It's reviewing all the pricing that we have with customers. We're looking at our skews. Do we have the right skews considering that we are potentially entering into a recession? We know it's high inflation out there. So people are looking for more value, high value or affordable products. And we're looking at discussion with the customers to see if we can increase some of the volumes. But we're also looking at the structure including our own capacity. But what has happened in the end of Q3 and which will impact Q4 is that it has been a complete crop failure in the industry. This is not a dull isolated incident. This goes across the whole industry where almost 30 to 40% of all the iceberg and remain has failed. And that is due to an extreme heat that we had in the beginning or late summer, beginning of the fall, followed by rain. That crop failure combined with market being somewhat soft for value added products, value added is a little bit higher, has put the quarter to become challenging. But this doesn't change how we look at 2023 going forward. OK, and just to be clear, and I know you're not giving guidance, but can you help maybe give us your parameters on how you would be thinking about 2023? No, I don't think we are going to have that. I think it's a little early to give more comprehensive updates on 23 out of them. And I think what we'll do is as we finish out the year, we'll be more logical and sensible from from an investor perspective to give a more comprehensive update in the next quarter on where we see 23. In an overall basis, as Yohan says, we're just getting a run about luck in this division. And certainly the current production issues that in Selenos and California have been very unhelpful. But the underlying work with the new management that we've put in place with the some of the legacy total projects guys going over to help to get to assist beyond good. You know, a very good management team that they just need a little bit more input us and help to get over the home at the moment. We're making good progress in all of the profit-improving plans. And we'll update in the next call. What are you on 23? OK, and then if I give you a separate question, because in the slide that you did introduce this kind of asset life, kind of some of the parts, is a sell leaseback type transaction or that sort of corporate split to effectuate that kind of earnings profile under serious consideration at this juncture? And if not, just tell the think about what would get you to that point probably. Yeah, I'm going to, it's really just to illustrate to investors the very value of a long-term asset split we do have in this business. We see the most integral to our existing business so we don't actually have any plans to separate them or do a sale and leaseback of those assets. They are very important to us. We do, you look around at some of the farm rates, particularly in the US farm rates. They have very high valuations. People are seeing the value in long-term farming and other assets. And in this slide, we're just, you know, at a micro level, just setting it up for investors, look, this is what you own. You have some good net assets in the long-term asset division and you've got some affidlice, death-free, even dava-significant demand on it. It should attract a significantly greater value. But in the short term, we're not actually thinking about splitting the company. We like having the two pieces together, but you can actually look at them as two separately valuable businesses under the one ownership structure. All right, that's all. I really hope all of that's not thanks. Thanks Adam. Our next question comes from Roland French from Davy. Your line is open. Thank you. Hi everybody. I'm forgiving well. I have a couple of questions as well, if I could. Maybe you're starting on the banana business and maybe an update on in terms of color around contracting, since we last spoke. I guess, how have interactions gone across Europe and North America, as well as maybe just some color around the supply situation as it's gotten better, worse, as remain the same? And that's the first question on banana contracting. And then maybe just on the cost environment, I know in the outlook, you talk about currently seeing some positive friends, and I guess you're caveat that with some further challenges. Just maybe breaking that out in context of some of your key cost pockets. And then finally, and somewhat related, just on the supply chain, I know is clearly been friction with the last COVID in 24 months, just generally had the supply chain hasn't proved or disinproved. Let's get that book. Well, maybe you'll, and you take the first, and I'll pick up the other two. All right, so when it comes to bananas, it's been an absolutely interesting year. We started out having one view on how the year would develop and everything changed when Russia decided to invade Ukraine. And what happened then is that we had a lot of demand destructions. So demand fell off. We had to re-adjust supply, cost for important input materials went up, fertilizers, but actually also paper, the box that we are using, and effects collapse, the euro collapsed. We have been able to perform well. Under, although taking these back, we've been formed very well within the division. We now enter in the most intense negotiation period when we are negotiating with the customers. And as we did on the last call, as we said on the last call, we expected supply situation to become tight, and it has become tight. Supply has come down, probably even a little bit further than we have expected. So right now we are in a situation when we're going out to meet customers when we feel relatively comfortable that we will be able to pass on the cost increases that we have, yes, because of the tight supply situation. Of course, this is also, to a certain extent, complicating the negotiations that we have with our suppliers. But I think if you put them all together, we're ending up in a good position here looking into the next year. And then just following our material, a couple of questions rolling to them. And on the cost environment, it's very hard to call whether inflation has peaked or not. Peaked, we've seen even this week, some of the European countries' inflation rates were slightly down, but on the other hand, the UK rate of inflation was considerably up, but something like 45-year highs, as you will know. So I think in some of our segments, we are seeing some easing of inflation, but it's a little bit, a little bit early to call. And in terms of the supply chain, I mean, obviously, at the end of the second quarter, we had some really significant, strong impact because of poor congestion that had an unfortunate and big impact on our Chile and great business where ships were parked off the ports for just too long to hold the quality of the fruit and discharging it. They were too well for supermarket programs and lots of knock-on consequences. But we're seeing some easing of poor congestion, particularly in some of the areas in the US. And then fuels a little bit better and shipping, and if there are some evidence that shipping rates are all in, So first question is we think about the performance in the quarter and the outlook. In fresh vegetables, can we maybe talk about from where we are in ending the third quarter with the even thought loss and help us think about the trajectory and pathway and what has to happen for that to be a positive introduction to the fourth quarter and certainly in calendar 23? Yeah, maybe I can take that one more. So we are very happy with work that the division is doing right now. We are focusing on servicing the customers because we know good service in the end leads to a new customer contract and much easier pricing in discussions. And we are focusing and doing good progress on our turnaround plan. And we executing on that plan and there is a lot of different facets to that plan. It's about reviewing all the costs that we are having, it's reviewing all the pricing that we have with customers. We are looking at our skews. We have the right skews considering that we are potentially entering into a recession. We know it's high inflation out there so people are looking for more value, high value or affordable products. And we are looking at discussion with the customers to see if we can increase some of the volumes. But we are also looking at the structure including our own capacity. But what has happened in the end of Q3 and which will impact Q4 is that it has been a complete crop failure in the industry. This is not a dull, isolated incident. This goes across the whole industry where almost 30 to 40 percent of all the iceberg and remain has failed. Our late summer, the fall by rain. That crop failure combined with market being somewhat soft for value added products, value added is a little bit higher. Has put the quarter to become challenging. But this doesn't change how we look at 2023 going forward. Okay. And just to be clear, and I know you are not giving guidance, can you help maybe give you parameters on how you would be thinking about 2023? No, I don't think we have. I think it's a little early to give more comprehensive updates on 23 out of them. I think what we will do is as we finish out the year, we will be more logical and sensible from from an investor perspective to give a more comprehensive update in the next quarter on where we see 23. In an overall basis, as Yohan says, we are just getting a run about luck in this division. Certainly the current production issues. I think Selina and California have been very unhelpful. But the underlying work with the new management, we put in place with some of the legacy of the project that we are going to provide to the project. We are very good management team. We need a little bit more input and help to get over the moment. We are making good progress in all of the profit improvement plans. We will update the next call on our view on 23. Okay. And then if I give you a separate question, in this slide, you did introduce this kind of asset life, some of the parts. Is a sell leaseback type transaction or that sort of corporate split to effectuate that kind of earnings profile under serious consideration of this chunker? And if not, just tell the think about what would get you to that point. Probably. Yeah. I'm going to, it's really just to illustrate to investors the very value of a long term assets. We do have in this business. We see them as integral to our existing business. So we don't actually have any plans to separate them or do a sale and leaseback of those assets. They are very important to us. We do, you look around at some of the farm rates, particularly in the US farm rates. They have very high valuations. People are seeing the value in long term farming and other assets. And in this slide, we're just, you know, at a micro level, just setting it out for investors, look, this is what you own. You have some good net assets in the long term asset division and you've got some offered life debt free either, but the significant demand on it. It should attract a significant greater value. But in the short term, we're not actually thinking about splitting the company. We like having the two pieces together, but you can actually look at them as two separately valuable businesses only the one ownership structure. All right, that's all. I really hope for our passion on banks. Thanks Adam. Our next question comes from Roland French from Davey. Your line is open. Thank you. Hi everybody. I'm Ricky Fungwell. I have a couple of questions as well as I could. Maybe you're starting on the banana business and maybe an update on terms of color around contracting since we last spoke. I guess, I have interactions going on across Europe and North America as well as maybe just some color around the supply situation as it's gotten better and worse has remained the same. That's the first question on banana contracting. And then maybe just on the cost environment, I know in the outlook, you talk about currently seeing some positive friends and I guess you're caveat that with some further challenges. Just maybe breaking that out in context of some of your key cost pockets. And then finally, and somewhat related, just on the supply chain, I know it's clearly been friction has been asked to have 18, 24 months to generally have the supply chain has improved or it doesn't prove. Let's go to the last book. Maybe you'll, and you take the first and I'll pick up the other two. All right. So when it comes to bananas, it's been an absolutely interesting year. We started out having one view on how the year would develop and everything changed when Russia decided to invade Ukraine. And what happened then is that we had a lot of demand instructions. So demand fell off. We had to re-agest supply. Cost for important input materials went up. Exterior lychers but actually also paper, the box that we are using and effects collapse, the euro collapsed. We have been able to perform well under, although taking these back to off, we've been formed very well within the division. We now enter in the most intense negotiation period when we are negotiating with the customers. And as we did on the last call, as we said on the last call, we expect the supply situation to become tight and it has become tight. Supply has come down, probably even a little bit further than we have expected. So right now we are in a situation when we're doing out-to-meet customers, when we feel relatively comfortable that we will be able to pass on the cost increases that we have, yes because of the tight supply situation. Of course, this is also, to a certain extent, complicating the negotiations that we have with our suppliers, but I think if you put them all together, we're ending up in a good position here looking into the next year. And then just following our material, a couple of questions rolling in on the cost environment. You know, it's very hard to call whether inflation has peaked or not. Peaked we've seen even this week, some of the European countries inflation rates were slightly down, but on the other hand, the UK rate inflation was considerably up, but something like 45-year highs, as you will know. So I think in some of our segments, we are seeing some easing of inflation, but it's a little bit, a little bit early to call. And in terms of the supply chain, I mean, obviously, you know, at the end of the second quarter, we had some really significant, deep, strong impact because of poor congestion that had an unfortunate and big impact on our Chilean great business where ships were parked off the ports for just too long to hold the quality of the fruit and discharging it. They were too well for supermarket programs and lots of knock-on consequences. But we're seeing some easing of poor congestion, particularly in some of the areas in the US. And then fuels a little bit better and shipping. And if there are some evidence that shipping rates are maybe coming off their highs, but we'd be able to see it come through in a material way. So it's just a little bit, I mean, I think the supply chain is better than it has been. And hopefully, the south of the Dan cost to probably a little too early to call whether we hit the peak or not. OK, great. And maybe just a quick follow-up. How seasonal is the Chilean great business? It's very seasonal. The minute is very, very, very, very, very, just runs for a number of months, really from the early part of the year. Good job. Great. Thanks so much. Let's look. Thanks, Sean. We now have to end Ben Benvenu from Stevens. Your line is open. Yeah, thanks so much. Morning. Morning, Ben. I want to ask about the comments you made on pricing. You know that you expect to make continued pricing increases as we move forward. And I'm curious. Are there categories in which you feel if you have more opportunity to take price versus others? And what are you seeing so far the perspective and consumer reaction to pricing increases you've taken? Yeah, I mean, obviously, you look at for our most important category being Benvenus. And it's starting from a low base. And so I think there's a willingness to acknowledge a cost increases, which can then get reflected in price increases to the consumer. And there's been some ups and downs as you described in terms of availability supply. But I don't think we're seeing any fundamental change in consumer demand. I think pricing and some of the other higher priced categories, you look at mangoes, papayas, organics, products like that, that can be a little bit higher to get through. Significant pricing increases without affecting somewhat demand in those categories. But we stand back from it though, and we don't. I mean, there can be ups and downs. And it varies quite a bit across all of the different markets. Even within Europe, there are different supply demand and consumer demand to be looked at, saying versus Sweden, Ireland versus Holland, it does vary a lot. But standing back from it, we do not see any fundamental shift in the consumer desire to ease high quality food and beds in the least of life. OK, great. And then my second question was just related to M&A. Can you talk a little bit about what the environment offers you or the particular opportunities that you're looking at that you're excited about or focused on? And if you could kind of characterize the robustness of the pipeline that you have ahead of you, that would be helpful. Yeah, I'm going to obviously with the year that we've had been a huge and overwhelming focus of the internal management teams to try and get the veg division turned around. We keep an eye on what's happening in the M&A world. We know who the interesting companies are, the different segments, full of the berries, our bananas, our distribution, our other dattles. So we've got a very good database. And I think one of the interesting things about M&A is if you look at the three divisions being fresh fruit, diversified in the markets and diversified in Europe, pretty much all of our competitor companies are performing similarly well. So one of the things any fundamentals have changed in the value of those companies are we're not seeing any fire sales or anything or any great opportunities to buy any companies cheaply because the sector is actually doing well. And it's rather than unfortunate for us we've got the one division that we've got more work to do to fix. But we're keeping our eyes open and the opportunities that are out there. Short-term would probably some different priorities in terms of just getting more confidence with investors, delivering the numbers, getting the business back and track. And we have ongoing discussions with our M&A pipeline and not appropriate time. We think we can add in interesting pieces to the group. Great. Thanks so much. Thank you, Ben. Our next question comes from Christopher Barnes from Deutsche Bank. Your line is open. Hi, thanks for the question. Rory, I just wanted to pick up on a line that you just mentioned on the consumer. So with recession risk still palpable, inflation still high in absolute terms, are you noticing any like shifts in consumer behavior, whether that's trading down, shifting the shopping channels that they're in? I think you mentioned that there's still a propensity to consume, which is great. But has there been any shifts, whether North American Europe that's concerning you from a consumer behavior perspective? I mean, obviously all of the points you make, Christopher, are absolutely right. I mean, inflation, nervousness, lack of disposable income. I mean, thankfully, the beds tend to be low down the list of discretionary items that people stop buying. We've seen, it's actually difficult to measure it. But we haven't seen any material change in consumer behavior. Some of the higher price categories, as I mentioned, might be under a little more pressure. But it's not a material shift in demand for consumers are not continuing to buy things like mangoes and papayas that might be a little bit higher price per kilo. So we look back, some of those have been around long enough to have seen periods of difficult economies in the past. You go back to the European financial crisis back in the end of the 2000s. It's some short-term dips in some demand from consumers. Maybe some of the discounters who offer a narrower range and not the people do think about them at a bit more in this period, but we're not really concerned that there's any kind of fundamental shift in consumer behavior towards fresh, pollution, vegetable consumption. Okay, thanks, that's helpful. And then I just wanted to, I know you're not guiding to 23, just given where we are. But like, since it's mid-November, like, is there anything in share on performance like quarter to date across the divisions? Like, sounds like fresh vegetables is gonna be a little bit weaker than you anticipated. But how should we think about the other businesses just into four cues? I'm considering the range that you've guided. I'm a little bit. Yeah, what we're pretty happy with the other three divisions. Obviously, we look at our European business. The biggest impact is the FX ratio. We look at things like currencies like the Euro, year and year, 11% depreciation, the Swedish grant, which is important to us, is 15% year and year and year, and moving against the dollar. So when you're recranslating and reporting the dollars, that has quite a material impact on your numbers. And I guess even on a day-to-day trading basis, when you're importing as we do into, you know, Euro markets and desi-k markets, with the currency that's significantly weaker, and adding in inflation, repressures, it does put a little bit of pressure on those business, but nothing material. So we're pretty happy with our diversified businesses, our fresh food business. You know, we've got a really, really strong position in the banana and plant-aparole business. You know, number one, Dime North America. We've got an A-list customer base. We're really appreciative of the support we get from our customers. We work hard to make sure we meet all the service levels and requirements, and we've done that right through COVID times, right through supply complication times. I'm a, you know, our customers, I think, appreciate that. I'm work hard with them then to make sure that the cost chain items are appropriately reflected on the price. So with the exception of the vegetable business and for an exchange, we're feeling pretty good, you know? OK, great. Thanks, I'll pass it on. Our next question comes from Ken Saslo from Bank of Montreal. Your line is open. Hey guys, how are you? Good, Ken. Just two questions. My first one is when you talk about the Chilean grape crop and then you talk about the extreme heat or the iceberg, you said that it's contained to this quarter. Does it not impact next year? On the remote or me on the lettuce side, you said it, you know, your outlook for 2023 would not. In this slide, we're just at a micro level, just setting it out for investors. Look, this is what you own. You have some good net assets in the long term asset division, and you've got some asset life debt free either, or a significant demand on it. It should attract a significantly greater value. But in the short term, we're not actually thinking about splitting the company. We like having the two pieces together, but you can actually look at them as two separately valuable businesses only the one ownership structure. All right, that's all. I really hope all of that's not thanks. Thanks Adam. Our next question comes from Roland French from Davy. Your line is open. Thank you. Hi everybody, I'm Ricky Fungwell. I have a couple of questions as well as I could. Maybe you're starting on the banana business, and maybe an update on, in terms of color around contracting, since we last spoke, I guess, how have interactions gone across Europe and North America, as well as maybe just some color around the supply situation, as it's gotten better, worse, as remain the same. That's the first question on banana contracting. And then maybe just on the cost environment, I know in the outlook, you talk about currently seeing some positive friends, and I guess you caveat that with some further challenges. Just maybe breaking that out in context of some of your key cost pockets. And then finally, and some of our related just on the supply chain, I know is clearly been friction with the last 12-18-24 months, to generally have the supply chain hasn't proved or disinproved. Let's get that book. Maybe you'll, and you take the first, and I'll pick up the other two. All right, so when it comes to bananas, it's been an absolutely interesting year. We started out having one view on how the year would develop, and everything changed when Russia decided to invade Ukraine. And what happened then is that we had a lot of demand destructions. So demand fell off. We had to re-adjust supply, cost for important input materials went up, fertilizers, but actually also paper, the box that we are using, and FX collapsed, the euro collapsed. We have been able to perform well under, although taking these backtrusts, we've been formed very well within the division. We now enter in the most intense negotiation period when we are negotiating with the customers. And as we did on the last call, as we said on the last call, we expected supply situation to become tight, and it has become tight. Supply has come down, probably even a little bit further than we have expected. So right now, we are in a situation when we're going out to meet customers, when we feel relatively comfortable that we will be able to pass on the cost increases that we have, yes, because of the tight supply situation. Of course, this is also, to a certain extent, complicating the negotiations that we have with our suppliers. But I think if you put them all together, we're ending up in a good position here looking into the next year. And then just following our material, a couple of questions rolling to them. And on the cost environment, it's very hard to call whether inflation has peaked or not. Peaked, we've seen even this week, some of the European countries inflation rates were slightly down, but on the other hand, the UK rate of inflation was considerably up, but something like 45-year highs, as you will know. So I think in some of our segments, we are seeing some easing of inflation, but it's a little bit, a little bit early to call. And in terms of the supply chain, I mean, obviously, at the end of the second quarter, we had some really significant, deep, strong impact because of poor congestion that had an unfortunate and big impact on our Chile and great business where ships were parked off the ports for just too long to hold the quality of the fruit and discharging it. They were too well for supermarket programs and lots of knock-on consequences, but we're seeing some easing of poor congestion, particularly in some of the areas of the US. And then fuels a little bit better, shipping, if there are some evidence that shipping rates are maybe coming off their highs, but we've yet to see it come through in a material way. So it's just a little, I mean, I think supply chain is better than it has been. Hopefully, it will tap it down and cost a probably a little too early to call whether we hit the peak or not. OK, great. Maybe just a quick follow-up. How seasonal is the Chilean great business? It's very seasonal. The military just runs for a number of months, really, from the early part of the year. Gotcha. Great. Thanks so much. Let's look. Thanks, Roland. We now have to end to Ben Benvenu from Stevens. Your line is open. Yeah, thanks so much. Morning. Morning, Ben. I want to ask about the comments you made on pricing. You know that you expect to make continued pricing increases has been in poor and I'm curious. Are there categories in which you feel like you have more opportunity to take price versus others? And what are you seeing so far, the perspective, consumer reaction to pricing increases you've taken? Yeah, I mean, obviously you look at for most important category being bananas and it's starting from a low base. And so I think there's a willingness to acknowledge a cost increases, which should then get reflected in price increases to the consumer. And there's been some ups and downs, as Joa described in terms of availability supply. But I don't think we're seeing any fundamental change and consumer demand. I think pricing and some of the other higher priced categories, you know, you look at mangoes, papayas, organics, products like that, it can be a little bit higher harder to get through significant pricing increases without affecting somewhat demand in those categories. But we stand back from it though, and we don't. I mean, there can be ups and downs. And it's, you know, there is quite a bit across all of the different markets. Even within Europe, there are different supply demand and consumer demand to be looked at staying versus Sweden, Ireland versus Holland. It does vary a lot. But standing back from it, we do not see any fundamental shift in the consumer desire to each high quality food and vegetables that we supply. OK, great. And then my second question is related to M&A. Can you talk a little bit about what the environment offers you or the particular opportunities that you're looking at that you're excited about or focused on? And, you know, if you could kind of characterize the robustness of the pipeline that you have ahead of you, that would be helpful. Yeah, I mean, obviously with the year that we've had been a huge, general overwhelming focus of the intern management team is to try and get the veg division turned around. We keep an eye on what's happening in the M&A world. We know who the interesting companies are, the different segments, Philo looks, berries, our bananas, our distribution, our other titles. So we've got a very good database. And I think one of the interesting things about M&A is, you know, if you look at the three divisions being fresh fruit, God diversified, and America's and diversified in Europe, pretty much all of our competitor companies are performing similarly well. So, you know, one of the things any fundamental change in the value of those companies that we're not seeing any fire sales or anything or any great opportunities to buy any companies cheaply, because the sector is actually doing well. And it's a little bit unfortunate where else we've got the one division that we've got more work to do to fix. But, you know, we're keeping our eyes open and the opportunities that are out there. Short-term would probably some different priorities in terms of just getting more confidence with investors, delivering the numbers, getting the business back and track. And, you know, we have ongoing discussions with the M&A pipeline and not appropriate time. We think we can add in interesting pieces to the group. Great. Great. Thanks so much. Thank you, Ben. Our next question comes from Christopher Barnes from Deutsche Bank. Your line is open. Hi, thanks for the question. Rory, I just wanted to pick up on a line that you just mentioned on the consumer. So with recession risk still palpable, inflation still high in absolute terms, are you noticing any like shifts in consumer behavior, whether that's trading down, shifting, shifting the shopping channels that they're in? I think you mentioned that there's still a propensity to consume, which is great, but has there been any shifts whether in North American Europe that's concerning you from a consumer behavior perspective? I mean, obviously all of the points you make, Christopher, are absolutely right. I mean, inflation, nervousness, lack of disposable income. I mean, thankfully, Group Beds tend to be low down the list of discretionary items that people stop buying. I mean, we've seen, it's actually difficult to measure it, but I mean, we haven't seen any material change in consumer behavior. Some of the higher price categories I mentioned might be under a little more pressure, but it's not a material shift in demand for consumers or not continue to buy things like mangoes and for buyers, that might be a little bit higher price per kilo. So we don't, we look back, some of those have been around long enough, seen periods of difficult economies in the past. You go back to the European financial crisis back in the end of the 2000s. It's some short-term dips in some demand from consumers. Maybe some of the disc counters who offer a narrower range and not the folks, you know, the people do think about them at a bit more in this period, but we're not really concerned that there's any kind of fundamental shift in consumer behavior towards fresh, pollution, vegetable consumption. Okay, thanks, that's helpful. And then I just wanted to, I know you're not guiding to 23, just given where we are, but like, since it's mid-November, is there anything in share on performance like quarter to date across the divisions? Like, sounds like fresh vegetables is gonna be a little bit weaker than you anticipated, but how should we think about the other businesses just in support of you considering the range that you've guided? Yeah, what we're pretty happy with the other three divisions. You know, obviously we look at our European business. The biggest impact is really the FX ratio. You know, you look at things like currencies like the Euro, year and year, 11% depreciation, the Swedish crown, which is important to us at 15% year and year and movement against the dollar. So when you're recranslation and reporting in dollars, that has quite a material impact on your numbers. And I guess even on a day-to-day trading basis, when you're importing as we do into, you know, Euro markets and desi-cane markets, you know, with the currency that's significantly weaker and adding in inflation, repressures, it does put a little bit of pressure on those businesses, but nothing material. So we're pretty happy with our diversity, our diversity businesses, our fresh food business. You know, we've got a really, really strong position in the banana and plant-appled business, you know, number one guy in North America. We've got an A-list customer base. We're really appreciative of the support we get from our customers. We work hard to make sure we meet all the service levels and requirements and we've done that right through COVID times, through supply complication times. You know, our customers, I think, appreciate that. We work hard with them then to make sure that the cost chain items are appropriately reflected on the price. So with the exception of the vegetable business and for an exchange, we're feeling pretty good, you know. Okay, great. Thanks, Opethanon. Our next question comes from Ken Sazlo from Bank of Montreal. Your line is open. Hey guys, how are you? Good, Ken. Just two questions. My first one is when you talk about the Chilean grape crop and then you talk about the extreme heat on the iceberg, you said that it's contained to this quarter. Does it not impact next year? On the remote, on the lettuce side, you said your outlook for 2023 would not change on that. Is there a reason why a 30 to 40 percent change? Is it seasonal? Is there something to think about? And it sounds like Chilean crop is seasonal, and then I have a second question. Okay, on the Chilean one, it was actually nothing to do particularly with the crop, but the logistical issues that we had, which meant that ships and large volumes of products couldn't get discharged in the right time. And obviously you're dealing with a periscord product and then it gets delayed. And then the subsequent season product starts to arrive into the market at the same time. So we're working on it. We've just exceptionally unusual this year. So we're working on the basis that those supply chain disruptions going into 23 will not reoccur, and we don't expect them to reoccur. And we're looking at how we manage that to avoid the same magnitude or problem, the way it problems that we have at the end of the season. And then the iceberg situation under the lettuce situation, I mean, it is a very unusual situation in terms of the crop failure that Johan has described. We haven't seen such a dramatic one in quite a while, but I think it's an unusual type of weather circumstances. It's been partly responding to the case that we see some other areas of production that can compensate the vast, are that you don't repeat that crop failure going into 20, 23. I don't understand the further you want to add on that one. Johan, does my shelf care and understand the little matter? Yeah, no, the crop failure was at the tail end of the California season, and we now moving into the Arizona where we are in Arizona. It would have a little bit of an impact on their Arizona season just because we were starting then a little bit earlier than expected, but we should have psyched a lot of that coming into January 2023. Okay. My second and far more important question is, I hear you on the affid value and how you think about it. My question is, if you were to look back a year and now it looks forward three years, do you think your earnings power has changed based on the environment that we're in? Do you think it stays where you would have thought it would be, and can you give the pluses and minuses of how that will kind of emerge given your opinion? Yeah, I think if we look back over the last year, I thought I said a couple of times on the call, our three segments from Fresh Groups on our two diversified businesses. Yes, I'm back and you say, look, they've performed pretty solidly. You know, the European business on a like for like basis, we're pretty happy with it. A few ups and downs here, but they're balancing it on against the backdrop of, you know, the most unusual economic environment, pretty much all of us on this call will have lived in our lives. We've seen the war in Europe with the Russian-Becurian situation, the disruption to logistics caused by COVID and still enduring. So I think with that backdrop, we really performed well on our Fresh Group business, given our market position and given our diversity of sourcing, our shipping capacity, our infrastructure capacity, our management capacity within that division. I think, you know, we're feeling pretty good that those three divisions can continue to perform, and you can hopefully build our profitability by bringing even more so the two groups, two legacy groups together. The big problem has been the vegetable division and we're really focused on the turnaround plan. I think you all have described the recent, we just can't catch a break at the moment on that division. And the unfortunate, probably there's a situation where you've got lower volumes going into plants that depend on higher volumes to cover fixed costs and might just make our turnaround plan and it delays the implementation. But we're doing well. We're picking up volume. We've got some great work going on in terms of all different aspects of the business, from operational efficiency to cost efficiency to management to food safety, or every single area is under the microscope. So I'm feeling that we're, you know, given the business backdrop and the world backdrop, and you know, we need to maybe exchange right now a little bit between the year and dollar. And if we got really lucky, maybe some higher or other Russia can be convinced to step back from the Ukraine. And I think even from a psychological point of view, if somebody could do that, or change just economy, just for people to think a little less nervous about who the world is. So some of those macro effects obviously are outside of our control, but overall, you know, we're not feeling bad about this, so we're looking forward to the future pretty positively. Great. I appreciate it. Thank you. Thank you, Kim. This concludes our Q&A. I'll now hand over to Rory Bern, CEO for final remarks. Okay. So thank you everybody for joining us today. I think it's good to three numbers for us. So huge improvement on the prior year. Three out of a four divisions performed very well, a little bit unlucky in our fresh-based television, but we get there. So I think, you know, we've just got to take a more medium to longer-term view. And if we've got a great business, it's a really fantastic product market position, some really fantastic geographic positions. And we look to the future with confidence. So thank you very much. that are maybe coming off their highs, but we'd be able to see it come through in a material way. So it's just a little, I mean, I think, I think the blight chain is better than it has been. And hopefully it will set the down and cost a probably a little too early to call whether we hit the peak or not. Okay, great. Maybe just quick follow up. How seasonal is the Chilean Great Business? It's very seasonal. The military just runs for a number of months. Really from the early part of the year. Okay, great. Thanks so much. Let's look. Thanks for all. We now have to end Ben Ben, venue from Stevens. Your line is open. Yeah, thanks so much. Morning. Morning, Ben. I want to ask about the comments you made on pricing. You know that you expect to make them to need pricing increases as we move forward. And I'm curious. Are there categories in which you feel like you have more opportunity to take price versus others? And what are you seeing so far the perspective consumer reaction to pricing increases you take on? Yeah, I mean, obviously you look at for most important kind of category being bananas and it's starting from a low base. And so, you know, I think there's a willingness to acknowledge that cost, that cost increases which can then get reflected in price increases to the consumer. And you know, there's been some ups and downs as you go and described in terms of availability supply. But I don't think we're seeing any any any fundamental change in consumer demand. And I think pricing and some of the other higher priced categories, you know, you look at mangoes, papayas, organics, products like that, it can be a little bit higher, harder to get through significant pricing increases without affecting somewhat demand in those categories. But we stand back from it though and we don't. I mean, there can be ups and downs and it's, you know, there is quite a bit across all of the different markets even within Europe. There are different supply demand and consumer demand to be looked at staying versus Sweden, Ireland versus Holland. It does vary a lot. But standing back from it, we do not see any fundamental shift in the consumer desire to each high quality for the best in the supply. Okay, great. And then my second question was just related to M&A. Can you talk a little bit about what the environment offers you or the particular opportunities that you're looking at that you're excited about or focused on and, you know, if you could kind of characterize the robustness of the pipeline that you have ahead of you that would be helpful? Yeah, I mean, obviously with the with the year that we've had been a huge and overwhelming focus of the internal management teams to try and get the veg division turned around. We keep an eye on what's happening in the M&A world. We, you know, we know who the interesting companies are and the different segments. Phil, look, you know, berries are bananas are distribution are the data. So we've got a very good database. And I think one of the interesting things about M&A is, you know, if you look at the three divisions being fresh fruit, diversified in the markets and diversified in Europe, pretty much all of our competitor companies are doing performing similarly well. So, you know, one thing any fundamentals of change and the value of those companies are we're not seeing any fire sales or anything or any great opportunities to buy any companies cheaply because the sector is actually doing well and it's a little bit unfortunate for us we've got the one division that we've got more work to do to fix. But, you know, we're keeping our eyes open and the opportunities that are out there. Short-term would probably some different priorities in terms of just getting more confidence with investors, delivering the numbers, getting the business back and track. And, you know, we have ongoing discussions with our M&A pipeline and not appropriate time. We think we can add in interesting pieces to the group. Great. Great. Thanks so much. Thank you, Ben. Our next question comes from Christopher Barnes from Deutsche Bank. Your line is open. Hi, thanks for the question. Rory, I just wanted to pick up on a line that you just mentioned on the consumer. So, with recession risk still palpable and inflation still high in absolute terms, are you noticing any like shifts in consumer behavior? Whether that's trading down, shifting the shopping channels that they're in. I think you mentioned that there's still a propensity to consume, which is great, but has there been any shifts whether in North American Europe that's concerning you from a consumer behavior perspective? You know, I mean, obviously, all of the points you make, Christopher, are absolutely right. I mean, inflation, nervousness, lack of disposable income. I mean, thankfully, the veg tend to be low down the list of discretionary items that people stop buying them. I mean, we've seen, it's actually difficult to measure it, but I mean, we haven't seen any material change in consumer behavior. You know, some of the higher price categories I mentioned might be under a little more pressure, but it's not a material shift in demand for consumers that are not continued to buy things like mangoes and for buyers that might be a little bit higher price per kilo. So, we don't, we don't, you know, we look back, you know, some of those have been around long enough, you know, seen, you know, periods of difficult economies in the past. You go back to the European financial crisis back in the end of the 2000s. It's some short-term dips in some demand from consumers. You know, maybe some of the, the, the, the, the disc counters who, you know, offer a narrower range and not the folks, you know, the people do think about them and have a little bit more in this period, but we're not really concerned that there's any kind of fundamental shift in consumer behavior towards fresh, food and vegetable consumption. Okay, thanks. That's helpful. And then I just wanted to, I know you're not, you're not guiding to 23, just given, given where we are, but like just since, since it's mid-November, like, is there anything in share on performance like quarter to date across the divisions? Like sounds like fresh vegetables would kind of be a little bit weaker than you'd anticipated, but how should we think about the other businesses just in four cues? Considering the range that you've guided. Yeah, what we're pretty happy with the other three divisions, you know, obviously we look at our European business. The biggest impact is really the FX ratio. You know, you look at things like occurrences like the euro, year and year, 11% depreciation, the Swedish grant, which is important to us, is a 15% year and year and year movement against the dollar. So when you're recranslating and reporting the dollars, that has quite a material impact on your numbers. And I guess even on a day-to-day trading basis, when you're importing as we do into, you know, euro markets and desi-k markets, you know, with the currency that's significantly weaker, and adding in inflation, we pressures, it does put a little bit of pressure on those business, but nothing material. So we're pretty happy with our diversified businesses, our fresh food business. You know, we've got a really, really strong position in the banana and plant-up of business, you know, number one diamond of America. We've got an A-list customer base. We're really appreciative of the support we get from our customers. We work hard to make sure we meet all the service levels and requirements and we've done that right through COVID times, or through supply complication times, and you know, our customers, I think, appreciate that, and work hard with them then to make sure that the cost chain items are appropriately reflected on the price. So with the exception of the vegetable business and for an exchange, we're feeling pretty good, you know. Okay, great, thanks, Opethanon. Our next question comes from Ken Sazlo from Bank of Montreal, your line is open. Hey guys, how are you? Good, Ken. Just two questions. My first one is when you talk about the Chilean grape crop and then you talk about the extreme heat on the iceberg, you said that it's contained to this quarter, does it not impact next year? On the, on the, on the letter side, you said it, you know, your outlook for 2023 would not change and that is there a reason why a 30 to 40% change is it seasonal, is there something to think about? And it sounds like Chilean crop is seasonal and then I have a second question. Okay, on the Chilean one, it was actually nothing to do particularly with the crop, but the logistical issues that we had which meant that ships and large volumes of products couldn't get discharged in the right time. And obviously you're dealing with a perishable product and then it gets delayed. And then the subsequent season product starts to arrive into the market at the same time. So we're working on it. It was just exceptionally unusual this year. So we're working on the basis that those supply chain disruptions going into 23 will not reacquire and we don't expect them to reacquire. And you know, we're looking at how we manage that to avoid the same magnitude of problem, the real problem, so we have the end of the season. And then I mean, the iceberg situation and the letter situation, I mean, it is a very unusual situation in terms of the crop failure that Johan has described. We haven't seen such a dramatic one in quite a while, but I think it's an unusual kind of weather circumstances. There's been partly responsibility. Like we see some other areas of production that can compensate for that are that you don't repeat that crop failure going into 20, 23. I don't understand the further you want to add on that one, Johan, but my show can understand a little better. Yeah, no, the crop failure was at the tail end of the California season. And we now moving into the Arizona where we are in Arizona. It will have a little bit of an impact in their Arizona season just because we were starting then a little bit earlier than expected. But we should have psyched a lot of that coming into January, 2023. My second and far more important question is, I hear you on the affid value and how you think about it. My question is, if you were to look back a year and now it looks forward three years, do you think your earnings power has changed based on the environment that we're in? Do you think it stays where you would have thought it would be? And can you give the pluses and minuses of how that will kind of emerge given your opinion? Yeah, I think if we look back over the last year, I've said a couple of times on the call, our three segments from Fresh Groups on our two diversified businesses. Just to end back and you say, look, they've performed pretty solidly. We live in a European business on a like for like basis. We're pretty happy with it. A few ups and downs here, but they're balancing it on against the backdrop of most unusual economic environment. Pretty much all of us on this call will have lived in our lives. We've seen the war in Europe with the Russian Ukrainian situation, the disruption to logistics caused by COVID and still enduring. So I think with that background, we really performed well on our Fresh Group business, given our market position and given our diversity of sourcing, our shipping capacity, our infrastructure capacity, our management capacity within that division. I think we're feeling pretty good that those three divisions can continue to perform and you can hopefully build our profitability by bringing even more so the two groups, two legacy groups together. The big problem has been the vegetable division and we're really focused on the turnaround plan. I think you'll have to describe your recent that we just can't catch a break at the moment on that division and the unfortunate crop failure situation where you've got lower volumes, going into plants that depend on higher volumes to cover fixed costs and might just make a turnaround plan to raise the implementation. But we're doing well, we're picking up volume, we've got some great work going on in terms of all different aspects of the business from operational efficiency to cost efficiency to management for safety, or every single area is under the microscope. So I'm feeling that we're given the business backdrop and the world backdrop and all we need is maybe exchange rate moves a little bit between the year and dollar. And if we got really lucky, maybe some higher or other Russia can be convinced to step back from the Ukraine and I think even from a psychological point of view of somebody could do that, or if you know what change, just economy, just from people thinking we're really less nervous about who our world is. So some of those micro effects obviously they're outside of our control, but overall, you know, we're not feeling bad about life, so we're looking forward to the future pretty positively. Great, I appreciate it, thank you. Thank you, Kim. This concludes our Q&A. I'll now hand over to Rory Bern, CEO for final remarks. Okay, so thank you everybody for joining us today. I think it's good to three numbers for us huge improvement on the prior year, and three out of a four divisions performed very well, a little bit unlucky in our fresh-based division, but we get there. So I think, you know, we've just got to take a more medium to longer-term view, and if we've got a great business, it's a really fantastic product market position, some really fantastic geographic positions, and we look to the future with confidence. So thank you very much. Special risk is still palpable, inflation is still high in absolute terms. Are you noticing any like shifts in consumer behavior, whether that's trading down, shifting, shifting the shopping channels that they're in? I think you mentioned that there's still a propensity to consume, which is great, but has there been any shifts, whether in North American Europe, that's concerning you from a consumer behavior perspective? Obviously, all of the points you make, Christopher, are absolutely right, him in inflation, nervousness, lack of disposable income. I mean, thankfully, food and veg tend to be low down the list of discretionary items that people stop buying. I mean, we've seen, it's actually difficult to measure it, but we haven't seen any material change in consumer behavior. Some of the higher price categories I mentioned might be under a little more pressure, but it's not a material shift in demand for consumers that are not continuing to buy things like mangoes and for buyers that might be a little bit higher price per kilo. We look back, some of those have been around long enough, seen periods of difficult economies in the past. You go back to the European financial crisis back in the end of the 2000s. Some short-term dips in some demand from consumers. Maybe some of the disc counters who offer a narrower range and not the folks who think about them a little bit more in this period, but we're not really concerned that there's any kind of fundamental shift in consumer behavior towards fresh, frozen, vegetable consumption. Okay. Thanks, that's helpful. And then I just want to, I know you're not guiding to 23, just given where we are, but like, since it's mid-November, is there anything in share on performance like quarter to date across the divisions? Like, sounds like fresh vegetables is going to be a little bit weaker than you anticipated, but how should we think about the other businesses just into four cues considering the range that you've guided? Yeah, what we're pretty happy with the other three divisions. You know, obviously we look at our European business. The biggest impact is really the FX ratio. You know, you look at things like occurrences like the Euro, year and year, 11% depreciation, the Swedish grant, which is important to us at 17% year and year and year, moving against the dollar. So when you're recranslating and reporting the dollar, so how's it quite a material impact on your numbers? And I guess even on a day-to-day trading basis, when you're importing as we do into, you know, Euro markets and desi-k markets, you know, with the currency that's significantly weaker and adding in inflation, repressures, it does put a little bit of pressure on those business, but nothing material. So we're pretty happy with our diversified businesses, our fresh food business. You know, we've got a really, really strong position in the banana and plant-up of business, you know, number one guy in North America. We've got an A-list customer base. We're really appreciative of the support we get from our customers. We work hard to make sure we meet all the service levels and requirements and we've done that right through COVID times, right through supply complication times. You know, our customers, I think, appreciate that. I mean, work hard with them then to make sure that the cost chain items are appropriately reflected on the price. So with the exception of the vegetable business and foreign exchange, we're feeling pretty good, you know. Okay, great. Thanks, Opethanon. Our next question comes from Ken Sazlo from Bank of Montreal. Your line is open. Hey guys, how are you? Good, Ken. Just two questions. My first one is when you talk about the Chilean grape crop and then you talk about the extreme heat on the iceberg, you said that it's contained to this quarter. Does it not impact next year? On the remote, on the lettuce side, you said your outlook for 2023 would not change on that. Is there a reason why a 30 to 40 percent change is it seasonal? Is there something to think about? And it sounds like Chilean crop is seasonal and then I have a second question. Okay, on the Chilean one, it was actually nothing to do particularly with the crop but the logistical issues that we had which meant that ships and large volumes of products couldn't get discharged in the right time and obviously you're dealing with a perishable product and then it gets delayed and then the subsequent season product starts to arrive into the market at the same time. So we're working on it. It was just exceptionally unusual this year. So we're working on the basis that those supply chain disruptions going into 23 will not reoccur and we don't expect them to reoccur. And we're looking at how we manage that to avoid the same magnitude of problem that we have at the end of the season. And then from the iceberg situation under the lettuce situation, I mean it is a very unusual situation in terms of the crop failure that Johan has described. We haven't seen such a dramatic one in quite a while but I think it's an unusual type of weather circumstances. It's been partly responsible. We see some other areas of production that can compensate for that are that you don't repeat that crop failure going into 20, 23. I don't understand the further you want to add on that one, Johan, that my shelf can understand a little better. Yeah, no, the crop failure was at the tail end of the California season and we now moving into the Arizona where we are in Arizona. It will have a little bit of an impact on their Arizona season just because we were starting then a little bit earlier than expected. But we should have psyched a lot of that coming into January 2023. Okay. My second and far more important question is I hear you on the affid value and how you think about it. My question is if you were to look back a year and now it looks forward three years, do you think your earnings power has changed based on the environment that we're in? Do you think it stays where you would have thought it would be and can you give the pluses and minuses of how that will kind of emerge given your opinion? Yeah, I think if we look back over the last year, I thought I said a couple of times in the call are three segments from fresh fruit on our two diversified businesses. If I'm back and you say, look, they've performed pretty solidly. You know, we live in European business on a like for like basis. We're pretty happy with it. A few ups and downs here, but they're balancing it on against the backdrop of, you know, the most unusual economic environment. Pretty much all of us on this call will have lived in our lives. You know, the war in Europe with the Russian Ukrainian situation, the disruption. And the logistics caused by COVID and still enduring. So I think with that background, we really performed well on our fresh fruit business, given our market position and given our diversity of sourcing, our shipping capacity, our infrastructure capacity, our management capacity within that division. I think, you know, we're feeling pretty good that those three divisions can continue to perform and you can hopefully build our profitability by bringing even more so the two groups, two legacy groups together. The big problem has been the vegetable division and we're really focused on the turnaround plan. I think you'll have to survive your recent, we just kind of catch a break at the moment on my division and the unfortunate prop later situation where you've got lower volumes going into plants that depend on higher volumes to cover fixed costs and might have just made a turnaround plan if it delays the implementation. But we're doing well, we're picking up volume, we've got some great work going on in terms of all different aspects of the business from operational efficiency to cost efficiency to management for safety, or every single area is under the microscope. So I'm feeling that we're given the business backdrop and the world backdrop and all we need is maybe exchange rate moves a little bit between the year and dollar and if we've got really lucky, maybe some higher and other Russia can be convinced to step back from the Ukraine and I think even from a psychological point of view of somebody could do that, or change just economy, just from people thinking we're going to less nervous about who are the world is. Some of those micro effects obviously they're outside of our control but overall, we're not feeling bad about life so we're looking forward to the future pretty positive. Great, I appreciate it, thank you. Thank you again. This concludes our Q&A. I'll now hand over to Rory Bern, CEO for Final remarks. Okay, so thank you everybody for joining us today. I think it's good to three numbers for us, huge improvement on the prior year, three out of a four divisions performing very well, a little bit unlucky in our fresh, bad, stressful division but we get there. So I think we've just got to take a more medium to longer term view and we've got a great business with some really fantastic product market positions, some really fantastic geographic positions and look to the future with confidence. So thank you very much. change on that? Is there a reason why a 30 to 40 percent change? Is it seasonal? Is there something to think about? And it sounds like chilling crop is seasonal and then I have a second question. Okay, on the chilling one, it was actually nothing to do particularly with the crop but the logistical issues that we had which meant that ships and large volumes of products couldn't get discharged in the right time and obviously you're dealing with a perishable product and then it gets delayed and then the subsequent season product starts to arrive until the market at the same time. So we're working on it was just exceptionally unusual this year. So we're working on the basis that those supply chain disruptions going into 23 will not reoccur and we don't expect them to reoccur and we're looking at how we manage that to avoid the same magnitude of problem that we have at the end of the season. And then the iceberg situation and the ladder situation, I mean it is a very unusual situation in terms of the crop failure that Johan has described. You know we haven't seen such a dramatic one in quite a while but I think you know it's an unusual kind of weather circumstances that's been partly responsibility. We see some other areas of production that can compensate for that are that you don't repeat that crop failure going into into 20-23. I don't understand the further you want out about when Johan but my show can understand a little better. Yeah I know the crop failure was at the tail end of the California season and we now moving into the Arizona where we are in Arizona. It will have a little bit of an impact on their Arizona season just because we were starting then a little bit earlier than expected but we should have psyched a lot of that coming into January 20-23. Okay my second and far more important question is I hear you on the affid value and how you think about it. My question is if you were to look back year and now it looks forward three years do you think your earnings power has changed based on the environment that we're in do you think it stays where you was if thought it would be and can you give the pluses and minuses of how that will kind of emerge that are given your opinion. Yeah I think if we look back over the last year I thought I've said a couple of times on the call our three segments from fresh fruit on our two diversified businesses. Just to come back and you say look they've performed pretty solidly you know the European business on a like for like basis we're pretty happy with it a few ups and downs here but they're balancing management against the backdrop of you know the most unusual economic environment pretty much all of us on this call will have lived in our lives you know the war in Europe with the Russian Ukrainian situation the disruption to logistics caused by COVID and still enduring. So I think with that backdrop we really performed well on our fresh fruit business given our market position and given our diversity of sourcing our shipping capacity our infrastructure capacity our management capacity within that division I think you know we're feeling pretty good that those three divisions can continue to perform and you can hopefully build our profitability by bringing even more so the two groups two legacy groups together. The big problem has been the vegetable division and we're really focused on the turnaround plan. I think you'll have described recently we just kind of catch a break at the moment on my division and the unfortunate prop later situation where you've got lower volumes going into plants that depend on higher volumes to cover fixed costs and might go just make a turnaround plan and it delays the implementation but we're doing well we know picking up volume we've got some great work going on in terms of all different aspects of the business from operational efficiency to cost division to management to have food safety or every single area is under the microscope so I you know I'm feeling that we're you know we're you know given the business backdrop in the world backdrop and you know what we need is you know maybe exchange rate moves a little bit between the year and dollar and if we got really lucky maybe some higher or other Russia can be convinced to step back from the Ukraine and I think even from a psychological point of view if somebody could do master you know we're changed just economy just for you know people think we're going to less nervous about where the world is so and some of those micro effects obviously they're outside of our control but overall you know we're not feeling bad about life so we're we're you know we're looking forward to the future pretty positively. Great I appreciate it thank you thank you again. This concludes our Q&A I want to hand over to Rory Burns CEO for final remarks. Okay so thank you everybody for joining us today you know I think it's you know good good two three numbers for us a huge improvement on the the prior year and three out of a four divisions performed very well a little bit unlucky in our fresh vegetable division but we get there so I think you know we just got to take a more median to overturn view and we've got a great business with some really fantastic product market positions and some really fantastic geographic positions and we look to the future with confidence so thank you very much. just for people feeling a little less nervous about where the world is. Some of those micro effects obviously they're outside of our control, but overall, we're not feeling bad about life, so we're looking forward to the future pretty positive. Great, I appreciate it. Thank you. Thank you, Kim. This concludes our Q&A. I'll now hand over to Rory Bern, CEO for final remarks. Okay, so thank you everybody for joining us today. I think it's good to do three numbers for us. Huge improvement on the prior year. Three out of a four divisions performed very well. A little bit unlucky in our fresh-based television, but we get there. So I think we've just got to talk a more medium to long-term view, and we've got a great business. It's a really fantastic product market position. Some really fantastic geographic positions, and we look to the future with confidence. So thank you very much."
}
