{
"text": " Ladies and gentlemen, thank you for standing by. I am Irene, your course call operator. Welcome and thank you for joining this them integrated shipping service Q3 2022 earnings conference call. Throughout today's recorded presentation or participants will be in a listen only mode. The presentation will be followed by a question and answer session. If you would like to ask a question, you may press star followed by one on your touch tone telephone. Press the star key followed by zero for operator assistance. I would now like to turn the conference over to Ilana Holzman, head of investor relations. Please go ahead. Thank you, Irene. And welcome to Zen's third quarter 2022 financial result conference call. Joining me on the call today are Ellie Gleigman, the president of the CEO and the CEO of the CEO of Zen's CEO. Before we begin, I would like to remind you that during the course of this call, we will make forward a statement regarding expectations, predictions, projections or future events or results. We believe that our expectations and assumptions are reasonable. We wish to caution you that such statements reflect only the company's current expectations and that actual events or results may differ, including the criteria. You are kindly referred to consider the risk factors and cautionary language described in the documents that company filed with the Securities and Exchange Commission, including our 2021 annual course filed on form 20F on March 9, 2022. We undertake no obligation to update these forward looking statements. At this time, I would like to turn the call over to Zen's CEO, Ellie Gleigman. Ellie? Thank you, Ilana. And welcome everyone to today's course. The Insert Quater and 9-months performance reflects continued solid execution and trends in our financial results and profitability. These results are consistent with our expectation of market normalization beginning in the second hour of 2022, following an extended period of historic profit. However, over the past several weeks, we've seen a steep decline in freight rates and we previously assumed as consumer demanding the US and elsewhere a soft, the pace of normalization has accelerated in based on this evolving marketing environment, which revised our full year 2022 poker. For 2022, we now expect to generate a just EBW between $7.7 billion to $7.7 billion compared to our previous guidance of $7.8 to $8.2 billion in adjusted EBW between $6.3 billion compared to the previous projection of $6.3 to $6.7 billion. I know that based on our current guidance, 2022, adjusted EBW in adjusted EBW are expected to be once again all-time records. Current market conditions illustrate the volatile and fast-paced nature of our market. The outlook for the global economy is very uncertain as we see balanced macroeconomies and geopolitical risks rising inflation and interest rates and energy crisis in Europe, the extended war in Ukraine just to name a few. The external spending is done and now in consumer spending on services can return to normal demand for durable goods may be held even harder. All these spells challenging outlook for container shipping particularly given the schedule of asset deliveries planned for next year in 2024. So, we will further discuss our guidance and account market environment in great... later on the course and the potential impact of different factors including IMO 2023 on our building. In the Golden Result, dividend policy to pay 30% of quarterly net income, our bold declared a Q3 dividend of approximately $354 million or $2.95 dollars per share. We continue to return to the station of capital to shareholders, which remains a priority as we seek to create long-term value and enable shareholders to directly benefit from our strong results. So far, on account of 2022 results and including this quarter, we have returned over $1.26 billion or $10.55 dollars per share in dividends. During the first nine months of the year, as we concede slide number four revenue growth by 43% to $10.4 billion as compared to the same period in 2021. Building by elevated freight rates in zinc differentiated strategies, our just EBDA increased 55% and net income increased 43% compared to the nine months period in 2021. Most importantly, while market conditions remain dynamic, we continue to deliver strong EBDA and EBIT margins, highlighting our focus on profitability. Nine months 2022 adjusted EBDA margins, improved from 58% to 63% and adjusted EBIT margin, improved from 51% to 50% notably, our balance is also continues to be very strong. We started shareholders equity of $5.8 billion at the end of the quarter. In the third quarter of 2022, our revenue growth 3% yield over a to $3.2 billion and regenerated adjusted EBDA in net income of $1.9 billion and $1.2 billion respectively. Addacity EBDA and EBIT margin for the quarter was 63% and 48% respectively, though lower than in Q3 2021. Going to slide fire, in light of the fundamental changes in market conditions, it is important to highlight key elements of zinc strategy, our commercial and operational agility. We believe these translators enhance our position to operate in a more normalized straight rate environment. Over the past two years, we've been proactive to best position zinc for long-term success, as we continue to focus on optimizing profitability for the benefit of our shareholders. On slide fire, we list several initiatives that we have previously discussed. Example on the commercial side include our network of e-commerce lines to study and New Zealand and the UCISCOS. Our focus on the entire edge of trade, which is a very dynamic trade and the world largest trade in volume terms. And the expansion of our career activity, which we intend to grow even further. We have demonstrated our ability to adapt to prevailing market conditions and capture commercial opportunities. Today, our commercial presence is more diversified, allowing us to benefit from end, balance between variant trade dynamics. Yet, we remain committed to our global niche strategy and operating trades with clients the most attractive and where we can establish a competitive position. We believe this agility will provide us with significant resilience in this new market environment. Operationally, we remain very focused on securing the most competitive and efficiently possible to support our commercial strategy. As a reminder, we enter into our first agreement for the long-term charter of 10,000 to U vessels in February 2021. This vessel ideally suits to serve on our co-Asia to UCISCOS service. This charter agreement will have a positive impact on our structure next year as we take delivery of the vessels throughout 2020. We also expect to be the first planer to operate LNG vessels on this trade, offering them an important commercial deflanchion and enabling us to immediately reduce the carbon footprint of Zim and its customers. Most recently, we enter into an important agreement with Shell to secure the supply of LNG and efficiently banquered this vessel. For my digital investment, I would highlight the progress of sheep forward, our digital trade forwarder, which we launched about a year ago. As a reminder, sheep forward is a huge digital solution on the front and back end targeting SMEs from the US and Canada shipping from China and Vietnam. This capability offers an important efficiency compared to other industry players. While sheep forward still has very modest revenue at this time, its technology has proven itself and the potential in this multibillion market is clear. On that note, I will turn the call over to our CEO, Cepier, for his remarks on our financial result and additional comments on the market. Thank you, Ely and again. Welcome everyone. On slide 6, we present to financial and operational highlights. Our third quarter results reflect continued strong execution and the benefits of our differentiated approach combined with high footprint. Specifically, our average footprint rate rate of $3,353 in the third quarter was 4% higher compared to the third quarter of 2021. During the first nine months of the year, our average footprint was 43% higher than in the 2021 nine months period. Our current volume in the third quarter decline, 5%, compared to the same scale last year. Lower volumes during the third quarter result in primarily from continued congestion as well as more normalize the levels of consumer demand. Over the nine months period, our current volume was down 3%, compared to a proximity 2.5% decline in the market in the first nine months of 2022. We now on TCB, our current volume will be slightly down in 2022 on the four year basis as compared to 2021. That is due to software demand and continued congestion. Our free cash for the third quarter totaled $1.6 billion compared to $1.7 billion in the third quarter of 2021. Now, current volume in the thrones at 84% as compared to last year's Q3 test conversion rate of 83%. Turning now to our balance sheet total debt increased by 1.4 billion in prior year end. As in recent photos, this was mainly driven by the increased number of vector fixtures, long term charted duration, as well as higher daily chart rate. The first nine months of 2022 are cash, bank deposit and investment increased by 2.5 billion in the third quarter of 2021. find the most attractive and where we can establish a competitive position. We believe this agility will provide us with significant resilience in this new market environment. Operationally, we remain very focused on securing the most competitive and efficiently possible to support our commercial strategy. As a reminder, we enter into our first agreement of the long-term charter of 1015,000 EU vessels in February 2021. This vessel ideally suits to serve on our co-Asia to use this cost service. This charter agreement will have a positive impact on our cost structure next year as we take delivery of the vessels throughout 2020. We also expect to be the first liner to operate LNG vessels on this train, offering ZIM an important commercial deflanchirating and enabling us to immediately reduce the carbon food strength of ZIM and its customers. Most recently, we enter into an important agreement with Shell to secure the supply of LNG and efficiently banquered this vessel. From our digital investment, I would highlight the progress of sheep forward, our digital plate forwarder, which we launched about a year ago. As a reminder, sheep forward is a huge digital solution on the front and back end targeting SMEs from the US and Canada shipping from China and Vietnam. This capability offers an important efficiency compared to other industry players. While sheep forward still has a very modest revenue at this time, its technology has opened itself and the potential in this multi-billion market is clear. On that note, I will turn the call over to our CEO, Cephe, for his remark on our financial results in additional comments on the market. Thank you, Ely and again, welcome everyone. On slide 6, we present to financial and operational highlights. Our third quarter results reflect continued strong execution and the benefits of our deep and steady approach combined with high freightways. Specifically, our average freightway, the TU of $3,353 in the third quarter, was 4% higher compared to the third quarter of 2021. During the first nine months of the year, our average freightway was 43% higher than in the 2021 nine months period. Our current volume in the third quarter declined 5% compared to the same period last year. Lower volume during the third quarter resulted primarily from continuous congestion as well as more non-aligned levels of consumer demand. Over the nine months period, our current volume was down 3%, compared to a proximity 2.5% declining the market in the first nine months of 2022. In our DC base, our current volume will be slightly down in 2022 on the full year basis as compared to 2021. That is due to software demand and continued congestion. Our free cash for the third quarter totaled $1.6 billion compared to $1.7 billion in the third quarter of 2021. Now, carbon version rate in the strong 80% as compared to last year's Q3 session version rate of 83%. Turning now to our balance sheet total debt increased by 1.4 billion in prior year end. As in recent photos, this was mainly driven by the increased number of vessel fixtures long term charter duration as well as higher daily charter rate. The first nine months of 2022, our cash, bankability and investment increased by 300 million dollars. At taking on our fleet, the number of vessels we currently operate hasn't changed from our last report and currently sent at 149 vessels of which 10 are car carriers. The average remaining duration of our current charter capacity is 27.4 months down from the 28.6 month in August 2022. And reaching our current operating capacity to the scheduled delivery of our chartered new-grade vessels throughout 2023 and 2024. In 2023, 25 vessels are for renewal with 37.4 renewal now in 2024. This means we have a total of 62 upcoming vessels for renewal compared to the expected delivery of 46 chartered new-grade vessels during this time period. Moving on to our slide 7, you can see that we delivered very strong results over the last two plus years. And our net delivery ratio as a result has 20 downloads at the same time and is at zero time as of September 30. On Friday, coming to our three and nine months financial performance, our differentiated and proactive approach has continued to yield profitable results. Wevenew for the third quarter was 3.2 billion dollars. And 3% as compared to Q3 2021. While net income was 1.2 billion dollars compared to 1.5 billion in the comparable quarter. Adjusted the bidaw at 1.9 billion for the quarter compared to 2.1 billion last year, reflecting more normalized charging volumes and average performance. Our market dynamics have shifted, and continues to generate strong bidaw in the margin. Nine more margins were 63% for the bidaw in 64% for adjusted EBIT. This compared to 58% and 61% respectively in the same period last year. I would like also to note that our lower market in the third quarter were driven by higher flow costs, resulting from higher vessel costs due to the condition to our own operating capacity, following the determination of the slow purchase agreement we had with the 2.2 billion as of April 1. Couple of reasons of higher LFOs, but correct. Turning to slide 9, we carried 842,000 TUs in the third quarter compared to 884,000 TUs during the same period last year. As you can see, illustrated in the slide, lower volume of the trans-partific caused by softening demand and continuous effects from congestion in if cost costs was partially updated by growth in intraagia, Latin America and cross-way. Intraagia in particular is a key focus for us, and we do believe increasing trends with these growing trades will provide a significant resilience as market conditions normalize. Next, we met our cash flow bridge. We ended the Q3 2022 with a total cash condition of $4.4 billion, which includes cash and cash equivalent and also investments in banking position and other investments in agreement. During the first nine months of the year, our agency that VDEL's $6.6 billion converted into $5 billion cash flow from operation. Other cash flow items include $2.93 billion of net capital, $1.1 billion of net service mostly leaves the ability and dividend distribution of $2.9 billion. Moving to our guidance, as I already mentioned, with the pace of normalization accelerating, we have revised our full year 2022 forecast. We now expect to generate in 2022, as you did that, between $7.4 to $7.7 billion, and that is, the average between $6.3 billion. That is approximately five percent lower from a negative perspective than our previous guidance base of the mid-point of the range. Our underlying assumptions for our revised 2022 guidance reflect the steepest decline in spot trade rates and software demands as discussed in addition to adjusted contract rates. Again, we now expect our current goal to be slightly lower than 2021. On the cost side, we assume a slightly more favorable chart rate environment, though the impact marginal given the limited number of chartal videos. With that said, it worked highlighting that this year's TV will reflect fully erected highs for this. Turning to our view on the market environment, the supplied even balanced forecast should here reflect lower demand growth assumptions for 2022 and 2023 in light of the worsening macroeconomic environment. With the order group to fit racial current at approximately 27 percent of which 2.3 million CEOs are scheduled for delivery in 2023 and another 4.7 million CEOs scheduled for deliveries the following year, supply growth is expected to be considered a big redcer versus demand growths than previously projected. The combination of weaker demand, cooling freightways and the risk of oversupply creates a challenging business environment for container shipping. Yet, I would discuss why various market dynamics made back the effective supply and create the most stable business environment in the coming quarters. Next, with the sub-lack, the mirror image of the decline in freightways is the cooling off of the chartal market. The chartal market is also in return to more normalized conditions. As you can see here, chartal rates have significantly dropped and all those supply of peak types, options to secure chartless or shorter term durations are gradually coming back. The idle fleet has also slightly increased. As we have indicated in the past, our view is that effective supply growth may be smaller than is implied by the current order group due to the various fake factors that are being detailed here on slide 14. In 2023, poor congestion, limited terminal capacity and lacking length time infrastructure will continue to partially offset the expected supply growth, as well as possible slow steaming resulting from I-Bot 2023 regulation, which are expected to go into effect in January next year. I-Bot 2023 and the re-carbonization agenda, but also multi-lettingers to retire all the vessels, resulting in greatest cropping and obstetizing top of the new business capacity. Three page may also result in lower supply growth. Zulu is currently suggesting that there are only approximately 60% of the delivery with the on-site in 2023 and 55% in 2024, as both carriers and shipyards may want to postpone delivery as the former are facing weaker demand and the latter are facing higher cost. Liner, adapting, deployed capacity to demand signs of which we have seen in recent weeks may also support industry efficiency. On its note, we will open the call for questions. Ladies and gentlemen, at this time we will begin the question and on-sufficient. The question is, if you are using speaking equipment today, please let the handset before making your selection. Anyone who has a question may be pressed to follow the question at this time. Thank you very much. from the million dollars. At taking on our fleet, the number of vessels we can to the operate hasn't changed from our last report. And currently stands at 149 vessels, of which 10 are carcassier. The average remaining duration of our current charter capacity is 27.4 months, down from the 28th from 6th month, in August, 2022. And reaching our current operating capacity to the scheduled delivery of our chartered new-grade vessels throughout 2023 and 2024. In 2023, 25 vessels are for renewal with 37th April renewal now in 2024. This means we have a total of 62 upcoming vessels at for renewal compared to the expected delivery of 46 chartered new-grade vessels during this time period. Moving on to a slide 7, we can see that we delivered very strong results over the last two plus years. And our net delivery ratio as a result has 20 downwards at the same time and is at zero time as our set time was raised. On Friday, coming to our three and nine-ounce financial performance, our differentiated and proactive approach has continued to yield profitable results. Wevenew for the third quarter was $3.2 billion, and 3% as compared to $3.2, 2021. While net income was $1.2 billion compared to $1.5 billion in the comparable quarter. Adjusted the bidaw at $1.9 billion for the quarter compared to $2.1 billion last year, reflecting more normalized charging volumes and average performance. While market dynamics have shifted, the economy continues to generate strong a bidaw in the margin. Nine-ounce margins were 63% for the bidaw in 64% for adjusted a bid. This compared to 68% and 61% respectively in the same period last year. I would like also to note that our lower market in the third quarter were driven by higher flow resulting from a higher vessel drop due to the condition to our own operating capacity, following the determination of the slow purchase agreement we had with the 2-WF as of its first. Couple of reasons of higher LFO evaporates. Turning to slide nine, we carried 842,000 T using the third quarter compared to $884,000 T used during the same period last year. As you can see, illustrated in the slide, lower volume of the trans-partific caused by sustained demand and continuous effects from congestion in if cost-ports was partially assessed by roles in intra-Asia, Latin America, and cross-way. Intra-Asia in particular is a key focus for us, and we do believe increasing treasuries to these growing trades will provide a significant resilient as market conditions normalize. Next, we met our cash flow bridge. We ended the Q3 2022 with a total cash position of $4.4 billion, which includes cash and cash equivalent and also investments in banking position and other investment instruments. During the first nine months of the year, our agency that sells it from $6 billion converted into $5 billion cash flow from acceleration. Other cash flow items include $293 billion of net capital, $1.1 billion of debt service must yield the ability and dividend distribution of $2.9 billion. Moving to our guidance, as I already mentioned, with the face of normalization accelerating, we have revised our three years 2022 forecast. We now expect to generate in 2022, I just see that it's up between $7.4 to $7.7 billion, and that is the average between $6.3 billion. That is approximately five percent lower from a little bit perspective than our previous guidance based on the mid-point of the range. Our underlying assumption for our revised 2022 guidance reflects the steeper declines in spot rate rate and softer demands as discussed. In addition to adjusted contract rates. Again, we now expect our current volume to be slightly lower than 2021. On the cost side, we assume a slightly more preferable chart rate environment, though the impact marginal given the limited number of chart rate rate. With that said, it's worth highlighting that this year, this new effect will be a record high for this. Turning to our view on the market environment, the supplied even balanced forecast. Should here reflect lower demand growth assumptions for 2022 and 2023, in light of the worth and in macroeconomic environment. With the older group to fit racial current at approximately 27 percent of which 2.3 billion CEOs are scheduled for delivery in 2023. And another 4.7 billion CEOs scheduled for deliveries. The following year, supply growth is expected to be considered a big redcer versus demand growth than the new superjective. The combination of weaker demand, pouring freightways and the risk of oversupply creates a challenging business environment for content shipping. Yet, I will discuss why here is the market dynamic made back the effective supply and create the most stable business environment in the corner corner. Next, with the sub-lag, the mirror image of the decline in freightways is the cooling off of the chart market. The chart market is also again returning to more normalized conditions. As you can see here, chart rates have significantly dropped and all those supply of peak types options to secure chart rates or shorter term duration are gradually coming back. The idle fleet has also slightly increased. As we have indicated in the past, our view is that effective supply growth may be smaller than is implied by the current older group due to the various fake factors that are being declared here in July 14. In 2023, poor congestion, limited terminal capacity and lacking length time infrastructure will continue to partially offset the effective supply growth as well as possible slow-steaming resulting from idle 2020-23 regulation, which are expected to go into effect in January next year. I vote 2023 and the new carbonization agenda is also multi-legline to retire all the vessels, resulting in greatest crafting and offsetting top of the new-bless capacity. Trip rates may also result in lower supply growth. Zulu is currently suggesting that there are only approximately 60% of the delivery with the on-site in 2023 and 55% in 2024. As both carriers and Shifiards may want to postpone the delivery, as the former are facing weaker demand and the latter are facing higher costs. Liner adapting the growth capacity to demand signs of which we have seen in recent weeks may also support industry efficiency. On its note, we will open the call for questions. Ladies and gentlemen, at this time, we will begin the question and answer session. Anyone who wishes to ask a question, may press star followed by one on their touch train telephone. If you wish to remove yourself from the question queue, you may press star followed by two. If you are using speaking equipment today, please lift the handset before making your selection. Anyone who has a question may press star, followed by one at this time. One moment for the first question, please. Our first question is from a more knocked out of Jeffries. Please go ahead. Hi, thank you. Hi, Ely and W. Eir and Alana. Good afternoon. I just wanted to ask about liquidity and your touch position today. You've obviously got a pretty self-consciousness and you've obviously got a pretty sizable amount with 4.4 billion at the end of the quarter, which is over 35 bucks a share. And it's sort of been lying with the amount of that in liabilities you have. But just in general, I wanted to ask, how do you view your current cash position? Is that a comfortable amount that you're carrying now with all the uncertainty out there in terms of the outlook for the container market? And are there any levers to pull or you're thinking of pulling in order to maybe give you more cash? Just say if you can comment just your cash position. Sure, Omar. You know, we are very pleased that the balance sheet is strong at the time in need where the market is entering into a normalization state. And so having a very robust protective structure is a very good position to be as we experience the downward trend in the market. So there is a lot of uncertainty today to where the rates with tabularies when the normalization will eventually end. And we will obviously ask ourselves the question when we come to that point as to whether we have, we believe, extra cash to allocate to some other project or almost. Today, the technical allocation priority continues to be at the same as before, which is ensuring we continue to invest in growing our commercial prospect, securing a capacity, renewing our peak of equipment. We continue to look also at options to potentially grow in our value and look at potential M&A and M&A transactions. That is something that we continue to look into. Even though there is no rush for us to secure anything in this respect. And lastly and very importantly, we want to continue to be true to our commitment to our shareholders, which is to return a significant technical back to them. Thanks, Aviar, for that. And yeah, maybe just on that final point you're making about the return of capital. And how do you think about that that bit of policy going forward? I know the board ultimately is going to make the decision. But how do you think about the, you know, use the cash at the moment, given the softness in the market? And does a true up to 50% payout? Next quarter to the full year of 2022? But that makes sense. Or do you think sticking with 30% is more in line with your thinking? You know, at this stage, what I've been very important to the company is to say what we tend to do and execute on what we said. We tend to do. We've been consistent in that approach. I think since the first day of a as the analysis company, and we have adjusted October occasion. Of the new impact of dividend policy. But today, this quarter, we continue to be true to our world. And announced this 30% dividend payout. I think when it comes to what may be the discussion or the decision of the company in March, when we release our full year financial statement. It's a little bit too much to material today. It's a little bit too much to date. We'll find as to where we will learn. The consideration that will be taken at the time will be obviously how did we close the year? We also have importantly what do we think? The outlook is ahead of us. And there is a lot of unknown data at this point, which again, I think, make a say that's a little bit too early to be mature to open on what might be the two-way payment next year. Okay. Now that that's fair. And maybe just one final one. Just regarding the cost structure at the moment. Are there any levers to pull, you think, in terms of lowering run rate costs on some of the ships you have in house today? Not necessarily the new buildings, but the vessel on the water, the 149 that have roughly 27 months left of duration. Are there opportunities to maybe think about approaching the ship owners and lowering their base in exchange for added duration? Is that something that you're thinking of? Is that a realistic measure that you guys think? Is worth undertaking? This is all about something that we can consider. I mean, the ship owners are always willing to listen and engage with the chapter. If we were to reach a complete for longer, then we could visit the commercial term. So maybe this is something that might happen in the future. I think today we are focusing on making sure that we extract as much cost as we can on the way we operate. The productivity level of each of the agencies where people are on the field and on the ground. Use and leverage our digital initiative that also will allow us to increase the productivity level. Entering and negotiating with all of our suppliers not only the vessels suppliers, but all the terminals, the rates of next year. So there is a lot for us obviously to work out in order to continue to try to extract as much as we can in our organization that's going forward. So we focus on what we can control and be ready for the new normal of next year. Okay, very good. Thanks for the call. I'll turn it over. Next question is from Alexia Dugani of Boxies. Please go ahead. Good afternoon. Thank you for taking my question. I had a good start first. I'm just on the implied Q4 EBDA guy, the one billion dollars. Obviously the exit rate from Q3 has been quite strong, but clearly since the mid-September, we've seen the spot rate, and the client quite considerably. How should we think about the first half of Q4 versus the second half of Q4? Just to understand the exit rate as we go into the next year. Then secondly, on your comments about unit growth ability to change. When we look at 2023 and the current trajectory of spot rates, how can you protect the stability? What action are you able to take from the data that you have in the data? Other than to basically reduce the capacity based on those, you know, the data you have between the upcoming vessels and the ones that are expiring. So yes, those two please. Thank you. So something is your first question. It is very true that the pace of the FCA5 index, the decrease has accelerated over the past few weeks. So towards the second part of the third quarter, it's been accentuated. So we have factored in our Q4 assumptions that lead to the guidance that we communicated today. A continuation of the trend to some extent. And so we expect Q4 average rate to be less than what we delivered into Q3. In addition to that, from a volume perspective, we are also considering, and you know, the two are being linked. In a way, there is a one hand demand that is certainly. And as a result, the company and also the, I think I have largely in the screen, might take some actions in terms of additional blanks. So we have also factored in a bit more of those in the course photo also explaining why the volume assumptions are a little bit lower than what we initially planned for. To your second question, looking at what. That is approximately five percent lower from a negative perspective than our previous guidance base of the midpoint of the range. Our underlying assumptions for our revised 2022 guidance reflect the steeper declines in spot weight weight and softer demands as discussed in addition to adjusted contract weight. Again, we now expect our current goal is to be slightly lower than 2021. On the cost side, we assume a slightly more favorable chart rate environment, though the impact marginal given the limited number of chart rate. With that said, it's worth highlighting that this year's TV will select fully erected highs for this. Turning to our view on the market environment, the supply given balance forecast forecast should here reflect lower demand growth assumptions for 2022 and 2023 in line of the worsening macroeconomic environment. With the older group to free ratio current at approximately 27 percent of which 2.3 billion CUs are scheduled for delivery in 2023 and another 4.7 billion CUs scheduled for delivery. The following year, supply growth is expected to be considered a big redcer versus demand growths than previously projected. The combination of weaker demand, 4.3 billion, and a risk of oversupply creates a challenging business environment for content shipping. Yet, I would discuss why there is market dynamics made back the effective supply and create the most stable business environment in the coming quarter. Next, with the sub-lag, the mirror image of the decline in freightways is the cooling off of the chart market. The chart market is also in return to more normalized conditions. As you can see here, chart rates have significantly dropped and all those supply of the type options to secure chart rates for shorter term duration are gradually coming back. The idle fleet has also slightly increased. As we have indicated in the past, our view is that effective supply growth may be smaller than is implied by the current older group due to the various thick factors that are being used in the past. In 2021, the limited terminal capacity and lacking length-time infrastructure will continue to partially offset the effective supply growth, as well as possible slow-steaming resulting from idle 2020-23 regulation, which are expected to go into effect in January next year. I vote for the end of the recapitization agenda, but also motive aligners to retire all the vessels, resulting in greatest cropping and obstetizing top of the new business capacity. Tripage may also result in lower supply growth. Zulu is currently suggesting that there are only approximately 60% of the deliveries with the onsite in 2023 and 55% in 2024. As both carriers and shipyards may want to postpone the delivery, as the former are facing weaker demand and the latter are facing higher costs. Liner, adapting the growth capacity to demand signs of which we have seen in recent weeks and they also support industry efficiency. All is note, we will open the call for questions. Ladies and gentlemen, at this time we will begin the question and on-session. Anyone who wishes to ask a question, my press star followed by one on their touch train telephone. If you wish to remove yourself from the question queue, you may press star followed by two. If you are using speaking equipment today, please let the handset before making your selection. Anyone who has a question, my press star followed by one at this time. One moment for the first question please. Our first question is from a more knocked out of Jeffries. Please go ahead. Hi, thank you. Hi, Ely and W. Eir and Alana. Good afternoon. I just wanted to ask about liquidity and your touch position today. We have a pretty sizable amount of 4.4 billion. The quarter, which is over 35 bucks a share, and it has been lying with the amount of that in liabilities you have. Just in general, I wanted to ask, how do you view your current cash position? Is that a comfortable amount that you are carrying now with all the uncertainty out there in terms of the outlook for the container market? Are there any levers to pull or you are thinking of pulling in order to maybe raise even more cash? Just say if you can comment just about your cash position. Sure, Omar. We are very pleased that the balance sheet is strong at the time in need where the market is entering into a normalization state. Having a very robust structure is a very good position to be as we experience the downward trend in the market. There is a lot of uncertainty today to where the rates with tablars when the normalization will eventually end. We will obviously ask ourselves the question when we come to that point as to whether we have, we believe, extra cash to allocate to some other project or almost. Today, the tactical allocation priority continues to be the same as before, which is ensuring we continue to invest in growing our commercial prospect, securing a capacity, renewing our thicker equipment. We continue to look also at options to potentially grow in our value and look at potential M&A and M&A transactions. That is something that we continue to look into even though there is no rush or secure anything in this respect. Lastly, and very importantly, we want to continue to be true to our commitment to our shareholders, which is to return to significant capital back to them. Thanks, Aviar, for that. Maybe just on that final point you are making about the returning capital. How do you think about that, that dividend policy going forward? I know the board ultimately is going to make the decision, but how do you think about the use of cash at the moment given the softness in the market? And that they true up to 50% payout next quarter for the full year of 2022? Does that make sense? Or do you think sticking with 30% is more in line with your thinking? At this stage, what I have been very important to the company is to say what we tend to do and to execute on what we said we tend to do. We have been consistent in that approach, I think, since the first day of a limited company and we have adjusted October occasion of dividend policy. So today this quarter we continue to be true to our world and announced this 30% dividend payout. I think when it comes to what may be the discussion or the decision of the company in March when we release our full year financial statement is a little bit too much too much to date. So today to apply as to where we will learn the consideration that will be taken at the time will be obviously how did we close the year but also as importantly what do we think the outlook is ahead of us and there is a lot of unknown data at this point, which again, I think make a say that it's a little bit too early to to mature to apply on what might be the to implement the next year. Okay, no, that's fair and maybe just one final one. I think that just regarding the cost structure at the moment, are there any levers to pull you think in terms of lowering our run rate costs and some of the ships you have in house today, not necessarily the new buildings that the vessel on the water, the 149 that have roughly 27 months less duration. Is there other opportunities to maybe think about approaching the ship owners and lowering their base in exchange for added duration. Is that something that you're thinking of is that realistic measure that you guys think is worth undertaking. This is always something that we can consider in the ship owners are always willing to listen and engage with the chapter if we were to release for longer that we could visit the commercial term. So maybe this is something that might happen in the future, I think today we are focusing on making sure that we extract as much cost as we can on the way we operate the productivity level of each of the agencies where where people are on the field and on the ground. Use and the leverage our digital initiative that also believe will allow us to increase the productivity level entering and negotiating with all of our suppliers not only the vessel suppliers that all the terminals the rate from next year. So there is a lot for us obviously to work out in order to continue to try to extract or limit because we can in our organization that going for so we focus on what we can control and and and and you ready for what the new normal of next. Okay very good. Thanks for the color alternate over. Next question is from Alexia Dugani of Boxies please go ahead. Good afternoon, thank you for taking my questions I had and to start first and just on the implied queue for EBDA guy the around $1 billion. Obviously the exit rate from Q3 has been quite strong but clearly since the mid September we've seen the sports rate and Bitcoin quite considerably. How should we think about you know the first half of Q4 versus the second half of Q4 just to understand you know the exit rate as we go into the next year. And then secondly on sort of your comments about sort of unit girls ability to change when we look at 2023 and the current trajectory of sports rates. How can you protect the stability what action are you able to take others and to basically reduce the capacity based on those you know the delta you have between the upcoming vessels and the and the ones that are expiring. So yes those two please thank you. Right so starting with your first question it is very true that the pain of the additional to the rate erosion of the if we take the FCA 5 index the decrease has accelerated over the past few weeks. And so what the the second part of the of the third quarter it's been accentuated so we have a fact that in in our Q4. Consumptions that lead to the guidance that we are being indicated today a continuation of the trend to some extent and so we expect Q4 average to be less than what we delivered into into a Q3. In addition to that from a volume perspective we are also considering and you know the two are being being linked in a way that is on the one hand the demand that is certainly and the result. The company and and also the I think I have not been in the screen by take some some actions in terms of additional blank. So we have also fact a bit more of those in the in the course photo also explaining why the volume assumptions are a little bit lower than what we initially plan for. To your second to your second question looking at what it is that we can do on the cost structure we talked about the vessel cost we've been as you know Zin has been transitioning from already over the past two years. From this evening from being very exposed to the short term charter market gradually and with all the contractors that we signed with the system. Time to start with and other other local owners we have a shift the towards being more exposed to long term chapter in the years to come and and and we have experienced an increase in the unit cost of the deal and this quarter and maybe to the next. In 2023 and beyond as we will take delivery of those new rules capacity the cost to you will mechanically go down in terms of the vessel cost the cost of sourcing capacity. In terms of variable cost also with the congestion easing we are going to enter less so which cost the flow of equipment is going to be improved as well we are looking at how we can best optimize the usage of our fleet of containers today we have a close to one million to you to the capacity of of equipment and it is very possible that we will deliver some of the older equipment. As the flow of cargo is in 2022 we will be more efficient in operating of the company. In terms of the split between the evolution and if we look at how we have accelerated we would be fair to say the big dice to towards the first half of Q4 roughly to third one third if I just look at the kind of projector right. I am not sure if you understand your question are you talking about the three months into Q4 whether we expect a further reduction in November and then stabilization in December. Yes exactly whether you expect most of the rest of the building to store to come from October and November and last in December. Today we expect the rate to continue to go down it depends also on the trade because we think that there are some trades that have been more exposed to the rates deterioration than others. For example the Atlantic is behaving better today the US West Coast has been suffering much more than the other trade lanes so we need to look at the mix of trade where we operate. We still take the view that the rate will continue to go down we see that the guidance in terms of range is still $300 million so we obviously we cannot be absolutely sure what will be the prevailing rate of the reminder of the year. We know that what the rates will be in the weeks to come up until the end of the year so what will affect also Q4 performance even if the box has reached their final destination by the end of the year that's the account use. Thank you. Next question is from the Tish, Isiva Kumar of city group please go ahead. Thanks again for the presentation I got two questions here so firstly on the any of guidance right you did say that one of the reasons for the vision and guidance is lower contract rates. If I understand right you got your contract rate exposure is mainly from Transpacific which normally resets in April right so why does we are asking lower contract rate versus say Q3 or this is your previous expectation any color on that and also directly like how much it's actually come down versus your previous 10 and the second one is on the supply type flexibility on supply immediately that okay you got about 60 vessels that are on charter that's due for renewal this is 40 vessels you are taking in but that's more like saying two years time where you get a better supply management there. But into next year given the uncertainties and if potentially further downturn in demand what what what are the tools that you have in terms of like supply management as you going to each one next year thank you. Thank you thank you for the question on the contract rate just to back to the perspective you have to be right that it's very much relevant for the Transpacific trading where we operate and we normally contract 50% of our volume with a long time contract and remain exposed to the spot market for the other 50%. So clearly what is happening with the with the cheap decline in the spot market on the some of the trade the spot market went below the contract rate and you may remember that initially when we close the contract is in April we close at elevated rates compared to the priority with that so the market is then of rates went down and across at some point in the in the quarter the average rate that you choose without the customer. The more importantly from our customer perspective the demand was not there and the volume was not there so we had to leave with this new reality and engage with our customers those customers are not customer for one year for one season they are recurring customers with whom we have a long term relationship and we tend to continue to have a long term relationship. So clearly the spread between the contract rate in terms of dollar to you and the end the source was increasing we had to sit down and agree and revisit the pricing for those customers in order to also protect some extent some of the. This is what has happened we need to be pragmatic and and make sure we find the middle ground between the interest of our customers and and ours. So your second question is respect to the supply side and the flexibility that we have we still believe that we said that 25 vessels are up for renewal and next year this is the significant amount that give us some flexibility and also when we look at which other vessels that we are going to take delivery from next year out of the 46 that we tend to get between 23 and 24. We'll get 18 of those in in 2023 and nine of them will be the the 15 thousand to use the last capacity vessel that we tend to deploy on the Asia US is cause the other nine will be a five thousand by bit and and three and the nine thousand and the use that we are we are waiting for those because they will be the most efficient one they will replace the capacity today that at the cost which from running the ship will be very similar allowing us to increase the intake by 50%. If we manage to increase the intake this will be an additional profit to the trade and if we don't this will be a neutral what obviously may happen depending on what the market conditions are we are also not alone in this way as you know we are trying to operate with the most enough to them out to a partner and then they might be also some. We are discussions around your whole network and there are a lot of options for us to entertain and consider as we go along in to 2023 and take those that they delivery of those ships. for the first question, please. Our first question is from a more knocked out of Jeffrey's. Please go ahead. Hi, thank you. Hi, Ely and W. Air and Alana. Good afternoon. I just wanted to ask about the liquidity and your task position today. You've obviously got a pretty sizable amount with 4.4 billion at the end of the quarter, which is over 35 bucks a share. And it's sort of been lying with the amount of that and liabilities you have. But just in general, I wanted to ask, how do you view your current cash position? Is that a comfortable amount that you're carrying now with all the uncertainty out there in terms of the outlook for the container market? And are there any levers to pull or you're thinking of pulling in order to maybe raise even more cash? Just say it if you keep comment just about your cash position. Sure, Omar. You know, the we are very pleased that the balance sheet is strong at the time in need where the market is entering into a normalization state. And so having a very robust structure is a very good position to be as we experience the downward trend in the market. So there is a lot of uncertainty today to where the rates with tabularies when the normalization will eventually end. And we will obviously ask ourselves the question when we come to that point as to whether we have, we believe, extra cash to allocate to some other project or almost. Today, the tactical allocation priority continues to be at the same as before, which is ensuring we continue to invest in growing our commercial prospect, securing a capacity, renewing our peak of equipment. We continue to look also at options to potentially grow in order, but we look at potential M&A and M&A transactions. That is something that we continue to look into. Even though there is no rush or to secure anything in this respect. And lastly and very importantly, we want to continue to be true to our commitment to our shareholders, which is to return to significant technical factors. Thanks, Aviar, for that. And maybe just on that final point you are making about the returning capital. And how do you think about that, that there is policy going forward? I know the board ultimately is going to make the decision. But how do you think about the use of cash at the moment given the softness in the market? And does a true up to 50% payout next quarter for the full year of 2022? But that makes sense. Or do you think sticky-mo 30% is more in line with your thinking? You know, at this stage, what I've been very important to the company is to say what we tend to do and execute on what we said. We tend to do. We've been consistent in that approach, I think, since the first day of a legalistic company. And we have adjusted October occasion of the Indian power dividend policy. But today, this quarter, we continue to be true to our world and announced this 30% dividend payout. I think when it comes to what may be the discussion or the decision of the company in March when we release our full year financial statement, there's a little bit too much to material today to apply as to where we will land. The consideration that will be taken at the time will be obviously how did we close the year, but also, as importantly, what do we think the outlook is ahead of us? And there is a lot of unknown data at this point, which, again, I think, make a say that's a little bit too early for to keep mature to apply on what might be the two-up payment next year. Okay, now that's fair. And maybe just one final one. Just regarding the cost structure at the moment, are there any levers to pull, you think, in terms of lowering our run rate costs on some of the ships you have in house today? Not necessarily the new buildings, but the vessel's on the water, the 149, that have roughly 27 months left of duration. Are there opportunities to maybe think about approaching the ship owners and lowering their base in exchange for added duration? Is that something that you're thinking of? Is that a realistic measure that you guys think is worth undertaking? This is always something that we can consider. I mean, the ship owners are always willing to listen and engage with the chapter, if we were to release a copy for longer, that we could visit the commercial term. So maybe this is something that might happen in the future. I think today we are focusing on making sure that we extract as much cost as we can on the way we operate, the productivity level of each of the agencies where people are on the field and on the ground. Use and leverage our digital initiative that also will allow us to increase the productivity level, entering and negotiating with all of our suppliers, only the vessels suppliers, or the terminals, the rates of next year. So there is a lot for us obviously to work out in order to continue to try to extract as much as we can in our organization as we go for. So we focus on what we can control and be ready for the new normal of next year. Okay, very good. Thanks for the color. I'll turn it over. Next question is from Alexia Dugani of Bockeys. Please go ahead. Good afternoon. Thanks for taking my question. I had to start first. I'm going to start with the first one. I'm going to start with the first one. I'm going to start with the first one. Just on the implied Q4 EBDA guide, around $1 billion. Obviously the exit rate from Q3 has been quite strong, but clearly since the mid September, we've seen the spot rate and Bitcoin quite considerably. How should we think about, you know, the spot rate as we go into the next year? Then secondly, on sort of your comments about sort of unit cost ability to change. When we look at 2023 and the current trajectory of spot rates, how can you protect the stability? What action are you able to take from the data that you have? The data that you have, the data that you have, the data that you have, the data that you have, the data that you have, the data that you have, the upcoming vessels, and the ones that are expiring. So yes, those two please. Thank you. So, the additional to the rate erosion of the FDF5 index, the decrease has accelerated over the past few weeks. So, towards the second part of the third quarter, it's been accentuated. So we have factored in our Q4 assumptions that lead to the guidance that we communicated today. So, we have a continuation of the trend to some extent. And so we expect Q4 average rate to be less than what we delivered into Q3. In addition to that, from a volume perspective, we are also considering, and the two are being leaked. In a way, there is, on the one hand, the demand that is sustainably, and as a result, we have a lot of the company and also the, I think, I have largely in the screen, I take some actions in terms of additional blanks. So we have also factored it a bit more of those in the course photo, also explaining why the volume assumptions are a little bit lower than what we initially planned for. To your second question, looking at what it is that we can do on our cost structure, and that we have already been, as you know, Zim has been transitioning from already over the past two years, transitioning from being very exposed to the shorter chart market, gradually, with all the contractors that we signed with the TISC, and other medical owners, we have a shift, the towards being more exposed to long-term chart in the years to come, and we have experienced an increase in the unit cost of interior and this quarter and maybe into the next, but in 2023 and beyond, as we will take delivery of those numerous capacities, the cost for TU will mechanically go down in terms of the vet costs, the cost of sourcing capacity. In terms of variable cost, also with the congestion easing, we are going to incur less storage costs, the flow of equipment is going to be improved as well. We are looking at how we can optimize the usage of our fleet of containers. Today, we have a close to one million TU to within the capacity of equipment, and it is very possible that we will deliver some of the older equipment, as the flow of cargo is in 2022. We will be more efficient in operating of the fleet of containers. And the presentation is going to follow up on the first question. In terms of the split between the evolution, and if we look at how the fleet of containers have accelerated, would it be fair to say they would be die-cooked towards the first half of Q4, roughly 2-3-1-3rd, if I just look at the trajectory of rate. I am not sure if you understand your question. Are you talking about the three months into Q4, whether we expect a further reduction in November and then stabilization in December? Yeah, exactly. Whether you expect most of the rest of the building to store to come from October and November, and last in December. Today, where we expect the rate to continue to go down, it depends also on the trade, because we think that there are some trades that have been more exposed to the rate deterioration than others. For example, the Atlantic is behaving better today. The US West Coast has been suffering much more than the other trade lanes. We need to look at the mix of trade where we operate. We still take the view that the rate will continue to go down. You see that the guidance in terms of range is still $300 million. Obviously, we cannot be absolutely sure what will be the prevailing rate of the reminder of the year. We know that what the rate will be in the weeks to come, or until the end of the year. So what will affect also Q4 performance, even if the boxes have reached their final destination by the end of the year. That's the account you will see. Okay, and thank you. Next question is from the Tish, Isiva Kumar of City Group. Please go ahead. Thanks again for the presentation. I got two questions here. Firstly, on the any of guidance, right, you did say that one of the reasons for the vision and guidance is lower contract rates. If I understand, right, you got your contract rate exposure mainly from Trans Pacific, which normally resets in April, right? Because we are asking lower contract rate versus say Q3, or this is your previous expectation. Any color on that and also directly, like how much it's actually come down versus your previous expectation. And the second one is around the supply type flexibility on supply. You made it clear that you got about 60 vessels that are on charter that's due for renewal. This is 40 vessels you are taking in. That's more like saying two years time where you get a better supply management there. But into next year, given the uncertainties, and if potentially further downturn in demand, what are the tools that you have in terms of supply management? As you go into each one next year. Thank you. Thank you, thank you, Satish. The question on the contract rate, just to factor in the two perspectives, I would like to say that it's very much relevant for the Trans Pacific trade-in where we operate. And we normally contract 50% of our volume with a long-term contract and remain exposed to the spot market for the other 50%. So clearly what is happening with the with the steep decline in the spot market on the top of the trade, the spot market went below the contract rate. And you may remember that initially, when we closed the contract, it's an in April, we closed at elevated rates compared to the prior rate. And with that, so the market is then over rate went down and across at some point in the quarter, the average rate that you choose without customer. So more importantly, from our customer perspective, the demand was not there. And the volume was not there. So we had to leave with this new reality and engage with our customers. Those customers are not customer for one year. For one season, they are recurring customers, with whom we have a long-term relationship and we intend to continue to have a long-term relationship. So we have to be a spread between the contract rate in terms of dollar per T.U. And the source was increasing. We had to sit down and agree and revisit the pricing for those customers. In order to also protect some extent, some of the delivery. This is what has happened. We need to be pragmatic and make sure that we find the middle ground between the interest of our customers and ours. So your second question is with respect to the supply side and the flexibility that we have. We still believe that we said that 25 vessels are up for renewal next year. This is a significant amount that gives us some flexibility. And also when we look at which other vessels that we are going to take delivery from next year out of the 46, that we intend to get between 23 and 24, we will get 18 of those in 2023. And nine of them will be the 15,000 T.U. The last capacity vessel that we intend to deploy on the Asia-USE. Of course, the other nine will be 5,000 by bit and 3,000 T.U. And the 9,000, 16,000 T.U. That will be fun. We are eagerly waiting for those vessels because they will be the most efficient one. They will replace the capacity today that at the cost, which from running the ship will be very similar, allowing us to increase the intake by 60%. So if we manage to increase the intake, this will be an additional profit to the trade. And if we don't, this will be a neutral. What obviously may happen depending on what the market conditions are, we are also not alone in this way. As you know, we are trying to operate with the rest of the city to have to have partners and they might be also some re-added discussions around the whole network. And there are a lot of options for us to entertain and consider as we go along in 2023 and take those delivery of those ships. Okay, thank you. Thanks, Xavier. And thank you, and then Helen Natural. Thanks very much. Next question is from Sam Bland of JP Morgan. Please go ahead. Thank you. Thank you. I have introduced the first one is on the existing company from the existing company. I think it's a bit of a question. From the capacity across the market so far, I think my Q2 2020 is doing a lot of that yet. And if not, is that surprising? And the second question is, if we look at the market, will it be a little bit more about the market? What are the projects below the break even? Thank you. Sam, I hope I have a question right. You were a little bit grating up. But from what I understand, the first question was around the land ceiling and whether we think that there will be more of a capacity in the market. It is very likely, it is very possible. The objective of the company as far as the gold remains the same. We intend to be profitable in the trade where we operate. And we don't wish to assert capacity at a lot. So the idea will be to make sure that we always operate our capacity and the redeployed capacity. We arrange the network of a trade and the potential value of our line where we operate in order to always be in the position where we avoid losing money on a given voyage. So if the race continues to slide at the level of planting, we'll most probably continue to improve over the coming weeks. And we're going to your second question, which was whether there are some trades where we think the spot rate has already crossed the breakeven points from a profitability perspective. I think in some trades we are not far from that and maybe already crossed the line. I was referring to early on to the trade between Asia to LA, which has been the trade that has been very early, maybe one of the most early on, and we are now severely impacted by the sliding in the trade rate. As you know, on those trades we operate a specific service. We operate an expedited service, which still command the premium on the SCFI rate, but there is not much more room for further reduction in the trade. The 20 is still quite resilient. The US is close and is a bit more resilient as well. Latin America was very resilient in the quarter is now sliding a bit more. So there is a difference in the face of the normalization, but eventually we think all the trades will find a new equilibrium at some point. Thank you very much. This concludes our Q&A session and I hand back to Elyk Lickman, president and CEO for closing comments. Thank you. Zim continues to deliver outstanding execution and profitable growth collected in our third quarter in nine months 2022 financial result. EBDA and EBIT margins remain strong in order of outstanding cash generation. Has enabled Zim to declare over $1.26 billion. So $10.55 in 2020 to dividends. By the pace of market normalization is accelerated over the past several weeks. We remain on track to generate 2022 just a bit and EBIT that will represent all year records. I would like to conclude by highlighting that Zim has been proactive over the last two years taking a significant step to enhance and build resilience in our business to best positions in for the new normal. Commercially, with the worth, they diversify our business and have multiple growth engines. We also secure a competitive, efficient and cost effective new build capacity to support our commercial strategy for the benefit of customer and show. Thank you very much for tuning in. We look forward to reporting on our continued progress. Have a good day. Ladies and gentlemen, the conference is now concluded and you may disconnect your telephone. Thank you for joining and have a pleasant day. Good bye. about approaching the ship owners and lowering their base in exchange for added duration. Is that something that you're thinking of? Is that realistic measure that you guys think? Is worth undertaking? This is always something that we can consider. I mean, the ship owners are always willing to listen and engage with the chapter or if we were to release a copy for longer, we could visit the commercial terms. So maybe this is something that might happen in the future. I think today we are focusing on making sure that we extract as much cost as we can on the way we operate, the productivity level of each of the agencies where people are on the field and on the ground. Use and leverage our digital initiative that they also believe will allow us to increase the productivity level. Entering and negotiating with all of our suppliers, not only the vessel suppliers, but all the terminals, the rates of next year. So there is a lot for us obviously to work out in order to continue to try to extract as much as we can in our organization as we go for. So we focus on what we can control and be ready for the new normal of next year. Okay, very good. Thanks for the color. I'll turn it over. Next question is from Alexia Dugani of Boxies. Please go ahead. Good afternoon. Thanks for taking my question. I had to start first. Just on the implied Q4 EBDA guide, around $1 billion. Obviously the exit rate from Q3 has been quite strong, but clearly since the mid-September, we've seen the sports rate decline quite considerably. How should we think about the first half of Q4 versus the second half of Q4? Just to understand the exit rate as we go into the next year. Then secondly, on your comments about unit growth ability to change. When we look at 2023 and the current trajectory of sports rates, how can you protect the stability? What action are you able to take other than to basically reduce the capacity based on those, you know, the delta you have between the upcoming vessels and the one that are expiring. So yes, those two please. Thank you. Right. So starting with your first question, it is very true that the pace of the additional to the rate erosion of the FCA5 index, the decrease has accelerated over the past few weeks. And so what the second part of the of the third quarter has been accentuated. So we have factored in in our Q4 assumptions that lead to the guidance that we communicated today. A continuation of the trend to some extent. And so we expect Q4 average rate to be less than what we delivered into Q3. In addition to that, from a volume perspective, we are also considering and you know, the two are being linked in a way that is on the one hand, the demand that is certainly and the result. The company and also the I think I have left the industry might take some some actions in terms of additional blank. We have also factored in a bit more of those in the course photo also explaining why the volume assumptions are a little bit lower than what we initially plan for. To your second question, looking at what it is that we can do on our cost structure, we talked about the vessel cost. We've been as you know, Zim has been transitioning from already over the past two years transitioning from being very exposed to the short and charter market. Gradually, we've already contacted that we signed with the. Time to start with another member of the owner. We have a shift the towards being more exposed to long term chapter in the years to come and and we have experienced an increase in units cost of until this quarter and maybe to the next. But in 2023 and beyond, as we will take delivery of those new rules, the cost for you will mechanically go down in terms of the vessel cost, the cost of sourcing capacity. In terms of variable cost also with the congestion easing and we are going to enter less so which cost the flow of equipment is going to be improved as well. We are looking at how we can optimize the usage of our fleet of containers. Today we have a close to one million to you to the capacity of of equipment and it is very possible that we will deliver some of the older equipment as the flow of cargo is in 2022. We will be more efficient in operating of the. And depending on the follow up on the first question in terms of the kind of split between the evolution and if we look at how I'm still going to have accelerated would it be fair to say the big die skew towards the first half of q4 roughly to third one third if I just look at the kind of trajectory rate. I'm not sure you understand your question are you talking about the three months into q4 whether we expect a further reduction in November and then stabilization in December. Yeah, exactly whether you expect most of the rest of the building to store to come from October and November and last on December. Today, we expect the rate to continue to go down. It depends also on the trade because we think that there are some trades that have been more exposed to the rates deterioration than others. So, for example, the at 20th is behaving better today the the US West Coast has been suffering much more than the other trade lane. So, we need to look at the mix of trade where we operate. We still take the conservative view that the rate will continue to go down. We see that the guidance in terms of range is still $300 million. So, obviously we cannot be absolutely sure what will be the prevailing rate of the reminder of the year. We know that what the rates will be in the weeks to come, up until the end of the year. So, what will affect also our q4 performance even if the year the box has reached their final destination by the end of the year that's the account use. Okay, and thank you. Next question is from the Tish, Isiva Kumar of city group. Please go ahead. Thanks again for the presentation. I got two questions here. So, firstly on the any of guidance right you did say that one of the reasons for the vision and guidance is lower contract rates. If I understand right you got your contract rate exposure is mainly from Trans Pacific, which normally resets in April right. So, why does we are asking lower contract rate versus say q3 or this is your previous expectation any color on that and also directly like how much it. It's actually come down versus your previous expectation and the second one is around the supply type flexibility on supply. You made it clear that okay you got about 60 vessels that are on charter that's due for renewal. This is 40 vessels you're taking in but that's more like saying two years time where you get a better supply management there. But into next year given the uncertainties and if potentially further downturn in demand what what what are the tools that you have in terms of like supply management as you going to each one next year. Thank you. Thank you. Thank you. The question on the contract rate just to back it to perspective you have to be right that it's very much relevant for the Trans Pacific. It's really where we are all great and we normally contract 50% of our volume with a long time contract and remaining close to the spot market for the other 50%. So clearly what is happening with the with the cheap decline in the spot market on the some of the trade the spot market once below the contract rate and you may remember that initially when we close the contract isn't in April. We close at elevated rates compared to the priority with that so that the market is then of race went down and across at some point in the in the quarter the average rate that you choose without the customer. The point importantly from our customer perspective the demand was not there and the volume was not there so we had to leave with this new reality and engage with our customers those customers are not customer for one year for one season they are recurring customers with whom we have a long term relationship and we tend to continue to have a long term relationship. So clearly the spread between the contract rate in terms of dollar to you and the end the source was increasing we had to sit down and agree and revisit the pricing for those customers in order to also protect some extent some of the. This is what has happened we need to be pragmatic and and make sure we find the middle ground between the interest of our customers and and ours. Your second question is respect to the supply side and the flexibility that we have we still believe that we said that 25 vessels are up for renewal and next year this is the significant amount that give us some flexibility and also when we look at which other vessels that we are going to take delivery from next year out of the 46 that we tend to get between 23 and 20. We will get 18 of those in in 2023 and nine of them will be the the 15 thousand to use the last capacity vessel that we tend to deploy on the Asia US is cause the other nine will be a five thousand by bit and and three and three and the nine thousand and the use that we are we are eagerly waiting for those vessels because they will be the most efficient one they will replace the capacity today that at the cost which from running the ship will be very similar allowing us to increase the intake by 60%. So if we manage to increase the intake this will be an additional profit to the trade and if we don't this will be a neutral what obviously may happen depending on what the market conditions are we are also not alone in this way as you know we are trying to operate with the rest of the city to them are to a partner and then they might be also some. We are we are discussions around your whole network and there are a lot of options for us to entertain and consider as we go along into 2023 and take those that they believe over of those shifts. Okay. Thank you. Thanks a very and thank you and then Helen. Thank you very much. Next question is from Sam blend of JP Morgan please go ahead. Thank you. I think doing the question I have introduced. The first one is on the seems many of my action from in terms of capacity across the market so far. I think my cue to 2020 with like sailing things that we've seen much of that yet and if not is that surprising. And the second question is if we look at the spot rates are there any lanes or regions for you to say current. But right are sort of below the brey even. Thank you. Sam I hope I got your question right. You were a little bit grating up but from what I understand there was the first question was around the land sailing and whether we think that they would be more of a head of it. And then there's been over the past few weeks. It is it is very likely it's very possible and the objective of the company and so it goes remains the same. We intend to be profitable in the trade where we operate and we don't wish to a fair capacity at a lot. So the the idea is we'll be to make sure that we always operate our capacity and the redeployed capacity. We arrange the network of a trade potentially over lines where we operate in order to always be in the position where we avoid losing a money on a given voyage. And then the race continues to slide at the level of blanking will most probably continue to improve over the coming over the coming week. And we're going to your second question which was whether there are some trades where we think the spot rates has already crossed the the brey even points from a profitability perspective. In some trade we are not far from that and they already crossed the cross the line. I was referring to early on to the trade between Asia to LA which has been the trade that has been a very early one of the most early on. And we are very impacted by the sliding in the trade rate. As you know on those trades we operate a specific service we operate an expedited service which still command the premium on the STFI rate. But but there is not much more room for further reduction in the trade. The traffic is still quite resilient the US is close to the big more resilient as well Latin America was very resilient in the quarter is now sliding a bit more so there is a different in the face of the normalization but eventually we think all the trade will find a new equilibrium at some point. Consider much. This concludes our Q&A session and I hand back to Ili Klickman, president and CEO for closing comments. Thank you. Then continues to deliver outstanding execution and profitable growth reflected in our third quarter in nine months 2022 financial result. EBDA and EBIT margins remain strong in order of 10 in cash generation is enabled them would be clear over 1.26 billion dollars 10.55 dollars per share in 2020 2022 dividends. Why the pace of market normalization is accelerated over the past several weeks we remain on track to generate 2020 to just a bit and EB that will represent all year records. I would like to conclude by highlighting the gym has been proactive over the last two years taking a significant steps to enhance and build resilience in our business to best positions in. Of the new normal commercially with the rest they specify the business and multiple goals engine. We also secure a competitive efficient and cost effective new build capacity to support our commercial strategy or the benefit of customer and show. Thank you very much for tuning in. Will you forward to reporting on continue progress has a good day. Ladies and gentlemen the conference is now concluded and you may disconnect your telephone. Thank you for joining and have a present day. Good bye. that we can do on our cost structure. We talked about the vessel cost. We've been, as you know, Zim has been transitioning from already over the past two years, transitioning from being very exposed to the short and charter market. Gradually, with all the contractors that we signed with the TISP, and to start with, and other vessel owners, we have a shift towards being more exposed to long-term chapter in the years to come. And we have experienced an increase in the UNICE cost of until this quarter and maybe into the next. But in 2023 and beyond, as we will take delivery of those numerous capacity, the cost for TISP will mechanically go down in terms of the vessel cost, the cost of sourcing capacity. In terms of variable cost, also with the congestion easing, we are going to enter less sewage cost. The flow of equipment is going to be improved as well. We are looking at how we can best optimize the usage of our fleet of containers. Today, we have a close to one million TUS-tapacity of equipment. And it is very possible that we will deliver some of the older equipment as the flow of cargo is in 2022. So we will be more efficient in operating of the type of containers. And the presentation is a follow-up on the first question. In terms of the split between the evolution, and if we look at how the soldered have accelerated, we would be fair to say the big die cubes towards the first half of Q4, roughly 2, 3rd, 1, 3rd. If I just look at the trajectory of rate. I'm not sure if you understand your question. Are you talking about the three months into Q4, whether we expect a further reduction in November and then stabilization in December? Yeah, exactly. Whether you expect most of the rest of the building to store to come from October and November, and last in December. Today, where we expect the rate to continue to go down, it depends also on the trade, because we think that there are some trades that have been more exposed to the rate deterioration than others. To some extent, for example, the Atlantic is behaving better today. The US West Coast has been suffering a much more than the other trade lanes. So we need to look at the mix of trade where we operate. We still take the view that the rate will continue to go down. We see that the guidance in terms of range is still $300 million. So obviously, we cannot be absolutely sure what will be the prevailing rate of the reminder of the year. We know that what the rate will be in the weeks to come will happen to the end of the year. So what will affect also Q4 performance, even if the boxes have reached their final destination by the end of the year. That's the accounting rules. Okay, understood. Thank you. Next question is from the Tish, Isiva Kumar of City Group. Please go ahead. Thanks again for the presentation. I got two questions here. So firstly on the any of guidance, right, you did say that one of the reasons for the vision and guidance is lower contract rates. If I understand, right, you got your contracted exposure as many from Transpacific, which normally resets in April, right? So why does we are accessing lower contract rate versus say Q3 or this is your previous expectation? Any color on that and also directly like how much it actually come down versus your previous expectation. And the second one is on the supply type flexibility on supply. You made it clear that, okay, you got about 60 vessels that are on charter that's due for renewal. This is 40 vessels you are taking in. But that's more like saying two years time where you get a better supply management there. But into next year given the uncertainties and if potentially further downturn in demand, what are the tools that you have in terms of supply management actually going to each one next year, thank you. Thank you, thank you, Satish. The question on the contract rate, just to factor into perspective, we are absolutely right that it's very much relevant for the Transpacific Triging where we operate. And we normally contract 50% of our volume with a long-term contract and remaining close to the spot market for the other 50%. So clearly what is happening with the with the steep decline in the spot market on some of the trade, the spot market went below the contract rate. And you may remember that initially when we closed the contract isn't in April, we closed at elevated rates compared to what acquired it. And with that, so the market is in terms of rates that went down and across at some point in the quarter, the average rate that you choose without customer. The more importantly from our customer perspective, the demand was not there. And the volume was not there. So we had to leave with this new reality and engage with our customers. Those customers are not customer for one year. For one season, they are recurring customers with whom we have a long-term relationship and we intend to continue to have a long-term relationship. So clearly the S-trend between the contract rate in terms of dollar per T-U and the S-Fost was increasing. We had to sit down and agree and revisit the pricing for those customers. In order to also protect some extent, some of the delivery. This is what has happened. We need to be pragmatic and make sure that we find the middle ground between the interests of our customers and ours. So your second question is with respect to the supply side and the flexibility that we have. And we still believe that we said that 25 vessels are up for renewal next year. This is the significant amount that gives us some flexibility. And also when we look at which are the vessels that we are going to take delivery from next year, out of the 46 that we intend to get between 23 and 24, we'll get 18 of those in 2023. And nine of them will be the 15 thousand T-U, the last capacity vessel that we intend to deploy on the Asia-U.S. It's called the other nine will be five thousand by bit and three thousand T-U. And the nine thousand, 16 thousand T-U that will be deployed. We are eagerly waiting for those vessels because they will be the most efficient one. They will replace capacity today that at the cost, which from running the ship will be very similar, allowing us to increase the intake by 50%. So if we manage to increase the intake, this will be an additional profit to the trade. And if we don't, this will be a neutral. What obviously may happen depending on what the market conditions are, we are also not alone in this trade. As you know, we are currently operating with the Western SEED to help out to our partners. And they might be also re-added discussions around the whole network. And there are a lot of options for us to entertain and consider as we go along in 2023 and take those the delivery of those ships. Okay. Yeah, thank you. Thanks, Xavier. And thank you, and then Helen Natural. Yeah, thanks very much. Next question is from Sam Bland of JP Morgan. Please go ahead. Thank you. I think the question I have introduced. The first one is on the SEED money at the market from in terms of the capacity across the market, so far, I think, due to 2020, with the same things. We've seen much of that yet, and if not, is that surprising? And the second question is, if we look at the spot rates, are there any lanes or regions for you to say, current spot rates are sort of below the brey-feaven, a little further. Thank you. Sam, I hope I have a question right here. You were a little bit gracing up, but from what I understand, the question was around the planet sailing, and whether we think that there will be more of a head of us than there's been over the past few weeks. It is very likely, it's very possible, and the objective of the company, as far as Zim goes, remains the same. We intend to be profitable in the trade where we operate, and we don't wish to sell capacity at a lot, so the idea will be to make sure that we always operate our capacity and the redeployed capacity. We arrange the network of a trade, potentially over lines, where we operate, in order to always be in a position where we avoid losing a money on a given voyage. So if the race continues to fly at the level of blanking, we will most probably continue to improve over the coming weeks. And we're going to your second question, which was whether there are some trades where we think the spot rate has already crossed the rate of end point from a profitability perspective. I think in some trades, we are not far from that, and maybe already crossed the line. I was referring to earlier on to the trade between Asia to LA, which has been a trade that has been a very severely, maybe one of the most early on, severely impacted by the sliding in the freightways. As you know, on those trades, we operate a specific service. We operate an expedited service, which still command the premium on the SCFI rate. But there is not much more room for further reduction in the trade. The Atlantic is still quite resilient. The US is close, and it's been a bit more resilient as well. Latin America was very resilient, and the quota is now sliding a bit more. So there is a difference in the face of the normalization, but eventually we think that all the trades will be able to be a very, very well-developed product. And we are going to have to find a new equilibrium at some point. Conclusion. This concludes our Q&A session, and a handbag to Ili Klickman, president and CEO for closing comments. Thank you. Then continues to deliver outstanding execution, which is a very important resource collected in our third quarter in nine months 2022 financial result. KiBiDA and EBIT margins remain strong. No doubt, 10 in cash generation has enabled Zim to declare over $1.26 billion. So $10.55 per share in 2020, 2022 dividends. And the third normalization is accelerated over the past several weeks. We remain on track to January 2020 to just a TBD and EBIT that will represent full year records. I would like to conclude by highlighting that Zim has been proactive over the last two years, taking a significant step to enhance and build resilience in our business to best position Zim of the new normal. Commercially, with the worth, diversifies our business and has multiple goals engine. We've also secure a competitive, efficient and cost effective new build capacity to support our commercial strategy for the benefit of customer and children. Thank you very much for tuning in. We look forward to reporting on our continued progress. Have a good day. Ladies and gentlemen, the conference is now concluded and you may disconnect your telephone. Thank you for joining and have a pleasant day. Bye. to your previous expert team. And the second one is around the supply type flexibility on supply. You made it clear that, OK, you got about 60 vessels that are on charter that's due for renewal. This is 40 vessels you are taking in. But that's more like saying two years time where you get a better supply management there. But into next year, given the uncertainties, and if potentially further downturn in demand, what are the tools that you have in terms of supply management as you're going to each one next year? Thank you. Thank you. Thank you, Satish. The question on the contract rate, just to factor into perspective, we have to be right that it's very much relevant for the transpatissist, the trade-in, where we operate. And we normally contract 50% of our volume with a long-term contract and we may expose the spot market for the other 50%. So clearly, what is happening with the steep decline in the spot market on the sub of the trade, the spot market went below the contract rate. And you may remember that initially, when we closed the contract is an in-appro, we closed at elevated rates compared to the requirements. With that, so the market incentives of rates went down and across at some point in the quarter, the average rate that you choose without customers. The point, importantly, from our personal perspective, the demand was not there. And the volume was not there. So we had to leave with this new reality and engage with our customers. Those customers are not customers for one year. For one season, they are recurring customers, with whom we have a long-term relationship. And we tend to continue to have a long-term relationship. So clearly, the SRED, between the contract rate in terms of $1.2U and the SRED was increasing. We had to sit down and agree and revisit the pricing for those customers, in order to also protect some extent, some of the delivery. This is what has happened. We need to be pragmatic and make sure that we find the middle ground between the interest of our customers and ours. So we have a second question with respect to the supply side and the flexibility that we have. And we still believe that we said that 25 vessels are up for renewal next year. This is a significant amount that gives us some flexibility. And also, when we look at which other vessels that we are going to take delivery from next year out of the 46 that we tend to get between 23 and 24, we'll get 18 of those in 2023. And nine of them will be the $15,000 TU, the last capacity vessel that we tend to deploy on the Asia-U.S. It's called the other nine will be $5,000 by bit and $3,000, $7,000 TU. And the $9,000 TU that will be deployed, we are equally waiting for those vessels because they will be the most efficient one, they will replace the capacity today at the cost, which from running the ship will be very similar, allowing us to increase the intake by 60%. So if we manage to increase the intake, this will be an additional profit to the trade. And if we don't, this will be a neutral. What obviously may happen, depending on what the market conditions are, we are also not allowed in this way, as you know, we are trying to operate with the rest of the seed to end the two partners. And then the might be also some real discussions around the whole network. And there are a lot of options for us to entertain and consider as we go along in 2023 and take those the delivery of those ships. OK, thank you. Thanks, Xavier. Thank you, and then Helen Natural. Thanks very much. Next question is from Sam Bland of JP Morgan. Please go ahead. Thank you. I think the question I have introduced. The first one is on the seed money at my back from in terms of capacity across the market, so far, I think, due to 2020, with the exciting things. We've seen much of that yet, and if not, is that surprising? And the second question is, if we look at spot rates, are there any lanes or regions for you to say, current spot rates are below the brey-feaven level for them? Thank you. Sam, I hope I have a question right. You were a little bit breaking up. But from what I understand, the first question was around the planet sailing, and whether we think that there will be more ahead of us than there's been over the past few weeks. It is very likely. It's very possible. And the objective of the company, as far as Zim goes, remains the same. We intend to be profitable in the trade where we operate. And we don't wish to sell capacity at a lot. So the idea will be to make sure that we always operate our capacity. And the redeployed capacity rearranged the network of a trade with potentially over lines where we operate in order to always be in a position where we avoid losing a money on a given voyage. So if the race continues to slide at the level of blanking, we'll most probably continue to improve over the coming weeks. And we're going to your second question, which was whether there are some trades where we think the spot rate has already crossed the rate even points from a profitability perspective. I think in some trades, we are not far from that. And they already crossed the line. I was referring to earlier on to the trade between Asia to LA, which has been the trade that has been a very severely, maybe one of the most early on, severely impacted by the sliding in the trade rate. As you know, on those trades, we operate a specific service. We operate an expedited service, which still command the premium on the SCFI rate. But there is not much more room for further reduction in the trade. The Atlantic is still quite resilient. The US is close, has been a bit more resilient as well. Latin America was very resilient. And the quota is now sliding a bit more. So there is a difference in the face of the normalization. But eventually, we think all the trades will finally with equilibrium at some point. Thanks very much. This concludes our Q&A session. And a hand back to Ili Klickman, president and CEO for closing comments. Thank you. Zim continues to deliver outstanding execution and profitable growth reflected in our third quarter in 9 months 2022 financial result. Kibbida and Ibi margins remain strong. No, 10 in cash generation has enabled Zim to declare over $1.26 billion. So $10.55 per share in 2020 to dividends. While the pace of market normalization has accelerated over the past several weeks, we remain on track to generate 2022, just a bit on Ibi that will represent all year records. I would like to conclude by highlighting that Zim has been proactive over the last two years, taking a significant step to enhance and build resilience in our business to best positions in for the new normal. Commercially, with the worth, they gratifies our business and its multiple goals engines. We've also secure a competitive, efficient and cost-effective new build capacity to support our commercial strategy for the benefit of customer and children. Thank you very much for tuning in. We look forward to reporting on our continued progress. Have a good day. Ladies and gentlemen, the conference is now concluded. And you may disconnect your telephone. Thank you for joining and have a present day. Good bye. Okay, yeah, thank you. Thanks, Xavier, and thanks, Ely, and then Helen, I'll jump. Yeah, thanks very much. Next question is from Sam Bland of JP Morgan. Please go ahead. Thank you. I think the question I have to introduce. The first one is on the screen. I think many have my connection in terms of capacity across the market so far. I think my Q2 2020 with like sailing and things. I've seen much of that yet and if not, is that surprising. And the second question is, if we look at spot rates, are there any lanes or regions for you to say, a current spot rates are sort of below the breakeven? Thank you. Sam, I hope I've got your question right. You were a little bit grating up, but from what I understand, there was a first question was around the planet sailing and whether we think that there will be more of a head of us than then there's been over the past few weeks. It is very likely, it's very possible. The objective of the company as far as Zim goes remains the same. We intend to be profitable in the trade where we operate. And we don't wish to assert capacity at a lot. So the idea is we'll be to make sure that we always operate our capacity and the redeploy capacity rearrange the network of a trade potentially over lines where we operate in order to always be in the position where we avoid losing a money on a given voyage. So if there is continue to slide at the level of blanking will most probably continue to improve over the coming over the coming weeks. And we're going to your second question, which was whether there are some trades where we think the spot rate has already crossed the breakeven point from a profitability perspective. I think in some trade we are not far from that and maybe already crossed the line. I was referring to earlier on to the trade between Asia to LA, which has been the trade that has been a very severely maybe one of the most early on, severely impacted by the sliding in the straight way. As you know, on those trades we operate a specific service. We operate an expedited service, we still command the premium on the SCFI rate. But there is not much more room for further reduction in the trade. The Atlantic is still quite resilient, the US is close to being a bit more resilient as well. Latin America was very resilient in the quarter is now sliding a bit more. So there is a difference in the face of the normalization, but eventually we think all the trades will finally be with equilibrium at some point. Concert. Thank you very much. This concludes our Q&A session and a hand back to Ili Klickman, President NTO for closing comments. Thank you. Then continues to deliver outstanding execution and profitable growth collected in our third quarter in nine months 2022 financial result. The EBEAT margins remain strong. No doubt. Ten in cash generation has enabled them to be clear over 1.26 billion dollars. Ten point five dollars per share in 2020, 2022 dividends. By the pace of market normalization is accelerated over the past several weeks. We remain on track to generate 2020 to just a bit on EBEAT that will represent all year records. I would like to conclude by highlighting that Zim has been proactive over the last two years taking a significant steps to enhance and build resilience in our business to best position Zim of the new normal. Commercially, with the worth, they diversify our business and have multiple goals engines. We've also secure a competitive, efficient and cost effective new build capacity to support our commercial strategy or the benefit of customer and show. Thank you very much for tuning in. We look forward to reporting on our continued progress. Have a good day. Ladies and gentlemen, the conference is now concluded and you may disconnect your telephone. Thank you for joining and have a different day. Good bye. business to best positions in for the new normal. Commercially, with the worth, they diversify our business and have multiple goals and engines. We've also secure a competitive, efficient, and cost-effective new build capacity to support our commercial strategy for the benefit of customer and shareholder. Thank you very much for tuning in. We look forward to reporting on our continued progress. Have a good day."
}